import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class biosvsec_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<biosvsec_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/ZGAxDtj0Zqs';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('EC  بایوس و'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''BIOS بایوس چیست؟
BIOS کوتاه شده و مخفف سیستم ورودی-خروجی پایه = Basic Input-Output system است؛ و یه نرم افزار سطح پایین است که داخل یه چیپ موجود روی مادربرد کامپیوتر قرار گرفته. وقتی کامپیوتر رو روشن میکنین BIOS هم شروع به کار میکنه. BIOS مسئول به کار انداختن اجزای سخت افزاری, مطمئن شدن از درست کار کردن اجزا و باعث به کارانداختن بوت لودر سیستم/سیستم عامل های دیگه ای که نصب کردین میشه.
تو صفحه BIOS setup میتونین ببینین که تنظیمات مختلفی وجود داره, مثل پیکربندی سخت افزار کامپیوتر, فرمان بوت و ... که همشون تو همین صفحه قرار دارن. شما هم میتونین با فشار دادن یه سری از دکمه ها (کامپیوتر با کامپیوتر فرق میکنه, اما اکثرا با فشار دادن Esc,F2,F10,F8 و Delete موقع بالا اومدن سیستم) وارد این صفحه بشین و تنظیمات دلخواهتون رو اعمال و ذخیره کنین. این تنظیمات توی حافظه ی مادربرد ذخیره میشه و وقتی هم که سیستم رو بوت میکنین, سیستم با همین تنظیماتی که ذخیره کردین بالا میاد.
BIOS قبل از اینکه سیستم عامل رو بوت کنه, اول پروسه POST (Power-On Self Test ) رو انجام میده تا ببینه پیکربندی سخت افزار ها درست و معتبره و به درستی کار میکنه یا نه. اگه جایی مشکلی وجود داشته باشه, یه پیام خطا رو خواهید دید و یا صدایی مثل بیپ, پشت سر هم و بشکل کد گذاری شده خواهید شنید. برای اینکه بفهمین این بیپ ها چه مفهومی دارن به دفترچه راهنمای مادربرد مراجعه کنید.

وقتی کامپیوتر بوت میشه ( و وقتی POST کارش تموم میشه) BIOS میره دنبال مستر بوت رکورد Master Boot Record یا همون MBR, که تو دستگاه بوت ذخیره و نگه داری میشه و برای راه اندازی و به کار انداختن بوت لودر بکار میره.
POST: وقتی کامپیوتر رو روشن میکنین, سیستم بلافاصله شروع به یه سری محاسبات میکنه؛ در واقع سیستم خودش رو تست میکنه تا مطمئن شه هیچ مشکلی برای بالا اومدن سیستم وجود نداره. وقتی POST انجام شد, یه بوق کوتاه رو میشنوین که نشون میده سیستم سالمه و مشکلی نداره و بعد از این بوق کوتاهه که سیستم میاد بالا.

بایوس ها از خیلی وقته که با ما هستن. حتی کامپیوتر هایی که تو دهه 1980 به بازار عرضه شدن BIOS داشتن!
البته BIOS ها با گذشت زمان پیشرفته تر و کامل تر شده اند و بعضی از برنامه های افزودنی توسعه یافتن, این برنامه ها شامل: (ACPI = Advanced Configuration and Power Interface) پیکربندی پیشرفته و رابط قدرت است که به BIOS اجازه میده تا دستگاه ها رو براحتی پیکربندی و عملکرد های پیشرفته مدیریت قدرت رو انجام میده. با وجود همه ی این ها BIOS در کنار پیشرفت تکنولوژی, پیشرفت چندانی نداشته.
BIOS های قدیمی همچنان داری محدودیت های جدی هستن. مثلا فقط میتونن از هارد دیسک های 2.1 ترابایتی یا کمتر بوت بشن. دیسک های 3 یا 4 ترابایتی و بالاتر امروزه خیلی رایج هستن و کامپیوترهایی که BIOS قدیمی دارن نمیتونن این هارد دیسک هارو راه اندازی و بوت کنن.
BIOS باید تو پروسه ی 16 بیتی کارشو شروع کنه و فقط هم 1 مگابایت فضا برای اجرا کردن این پروسه نیاز داره. اگه بخواین چند تا درایور رو هم زمان با هم نصب کنین, BIOS موقع نصب دچار مشکل میشه و سرعت فرایند بوت موقع نصب تمامی سخت افزار ها خیلی پایین میاد.
BIOS تو این مدت طولانی نیاز به یه جایگزین داشت. اینتل Intel شروع به کار روی یه رابط سیستم عامل توسعه پذیر the Extensible Firmware Interface (EFI) در سال 1998 کرد.اپل هم بر خلاف سایر تولید کننده های کامپیوتر در سال 2006 وقتی برای مک بوک هاش شروع به همکاری با اینتل کرد, EFI رو انتخاب کرد.
در سال 2007, Intel, AMD, Microsoft و سازنده های کامپیوتر در مورد یک رابط یکپارچه قابل ارتقا (UEFI) توافق کردند. استانداردهای UEFI یه استاندارد جهانیه که از طریق فروم UEFI ارائه شده و صرفا مختص Intel نیست. اکثریت کامپیوتر هایی که امروزه میخرین استفاده از UEFI رو نسبت به BIOS های قدیمی ترجیح میدن.

ولی در کل این ایسی یک محافظت کننده از اطلاغات بایوس و همینطور یکسری تنظیمات رو در خودش ذخیره میکنه و همینطور از با ای او نیز مرتبطه.
بعضی وقتا هم اطلاعاتش اسیب میبینه و در صورت خرابی سیستم یا روشن نمیشه یا روشن هم بشه خوب کار نمیکنه.
روش تشخیصشم سادست کافیه شماتیک مدار رو مطالعه کنی یا تجربه بیشتری در تعمیرات پیدا کنی.ولی کلا این ایسی نزدیک بایوس و ای او و همینطور چیپ قرار داره.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
