import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class change_comp_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<change_comp_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/EW9Y8rDm4kE';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('تعویض قطعات روی مادربرد'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''1- در ابتدا باید هویه مناسب داشته‌باشید و همچنین پنس مناسب که بتوانید به راحتی قطعه را بگیرید. بعد از این کار در ابتدا با استفاده از هویه یکی از پایه‌ها را حرارت دهید، به عبارتی نوک هویه را (منظور از نوک هویه بدنه‌ی نوک هویه است نه محل نوک تیز آن) به پایه قطعه چسبانده و بعد از چند ثانیه حرارت دادن قلع پایه بعدی را به همین ترتیب ذوب کنید تا قطعه آزاد شده و در همان لحظه با پنس قطعه را بردارید.

توجه کنید که ممکن است برخی از قطعات به‌راحتی با هویه جدا نشوند و به‌عبارتی قلع پایه‌ی قطعه ذوب نشده که این به دلیل کهنگی بیش از حد قطع پایه است، برای برداشتن چنین قطعاتی بهتر است که پایه را کمی لحیم کاری کرده و به عبارتی قطعه بزنید تا حرارت این قلع تازه قلع کهنه را ذوب کرده و با ذوب شدن، قلع کهنه با جدید مخلوط شده و مجددا نوسازی شود که در نتیجه می‌توانید به این طریق پایه‌های قطعه را ذوب و قطعه را از برد جدا کنید. در اینجا تمیز و براق بودن نوک هویه حرف اول را می‌زند و تا زمانی که نوک هویه‌ی شما کثیف است قطعه‌برداری خوبی خصوصاً در مبحث smd نخواهی داشت.

2- برداشتن قطعات smd که بیش از دو پایه دارند : ترانزیستورها، آی سی ها، دیودهای مختلف smd و رگولاتورها و …. از دسته قطعاتی هستند که smdبوده و تعداد پایه‌های آن‌ها بسیار زیاد است. به عنوان مثال ترانزیستور دارای سه پایه است. برای قطعه ای که سه تا پایه دارد جهت جدا کردن از برد نمی‌توان از هویه استفاده کرد زیرا تا شما یکی از پایه‌ها را ذوب کنید آن یکی سرد شده و نتیجه این که پایه‌های قطعه یا از برد جدا نمی‌شود یا در جدا کردن خود قطعه آسیب خواهد دید و هم این که متالیزه‌ی برد از بین می‌رود و وقتی متالیزه از بین برود به گونه‌ای که جبران نتوان کرد دیگر برد از کار خواهد افتاد، بنابرین همین نکات ریز نکاتی مهم هستند که در حین قطعه‌برداری باید آنها را در نظر گرفت.
خب پس چگونه یک قطعه ی smd چند پایه را جدا کنیم، این مبحثی است که در ادامه به آن پرداخته می‌شود.
شما برای آن که بتوانید یک قطعSMD چندپایه را از برد جدا کنید نیاز به وسیله‌ای دارید که هوای گرم و داغ و به‌عبارتی گرما را همزمان به همه پایه‌ها برساند تا شما بتوانید با پنس قطعه را گرفته و بعد از ذوب‌شدن قلع، پایه‌های آن قطعه را به‌راحتی بردارید. یکی از این ابزارها در زمینه‌ی قطعه برداری دستگاهی به نام هیتر است که می‌تواند باد خروجی داغی داشته باشد (که با استفاده از باد گرم که تنظیم دمای آن به دست شماست). شما به راحتی با استفاده از هیتر قادر خواهید بود قطعات با تعداد پایه‌های زیاد مانند آی سی را بردارید یا در محل خود نصب کنید.

روش استفاده از هیتر در قطعه برداری smd
خب در اینجا روش برداشتن یک آی سی smd با هیتر را شرح می‌دهیم. قبل از برداشتن ic مورد نظر که از نوع smd بوده، بهتر است پایه‌های آی سی و حتی خود آی سی را به روغنی جهت قطعه‌برداری به نام فلکسی آغشته کنید. (از این روغن جهت جلوگیری از سوختن قطعه در هنگام حرارت دادن و همچنین رساندن حرارت به صورت یکسان به دیگر قطعات استفاده می‌شود.)
بعد از آغشته کردن پایه‌های قطعه وهمچنین بدنه‌ی قطعه به روغن در ابتدا هیتر را در حالت 400 درجه قرار دهید و سپس دهانه‌ی خروجی حرارت هیتر را به آرامی به پایه‌های قطعه نزدیک کرده و پایه‌ها را به صورت گردشی حرارت دهید و هم‌زمان با دادن حرارت با استفاده از پنس، آی سی را گرفته و وقتی که دیدید پایه‌ها ذوب شده‌است به صورت عمودی آی سی را از برد جدا کنید و در یک مکان دیگری قرار دهید. زمانی که شکل یک قطعه الکترونیکی را برمی‌دارید خصوصاً smd، به‌دلیل حرارت هیتر قطعات اطراف آن قطعه‌ برداشته‌شده و پایه‌هایشان نیز ذوب شده و آماده جدا شدن با یک تلنگر هستند، بنابراین بعد از جدا کردن قطعه ی هدف بهتر است تا خنک شدن محل قطعه برداری هیچ کاری با برد نداشته باشید وگرنه باعث تکان خوردن و حرکت دیگر قطعاتی که ذوب شده اند میشود و وضعیت برد به حالت بدتری می‌رسد پس این موارد را فراموش نکنید.''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
