import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class charge_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<charge_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/wBzd1GNCph8';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('مشکلات شارژ و دیتکت باتری'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''بخشی از اطلاعات اولیه ای که دارندگان سرفیس نیاز به دانستن آن دارند این است که وقتی دستگاهشان در حالت Sleep مانده و روشن نمیشود یا به طور کلی وقتی سرفیس شان را نمیتوانند روشن کنند چه باید کرد.
قبل از شروع کار باید یک بررسی جزئی از وضعیت سرفیس داشته باشیم که در ادامه به آن میپردازیم :

✔ همه اتصال های سرفیس خود از جمله رابط برق آنرا قطع کنید.
✔ رابط های سرفیس خود را برای هرگونه آسیب بررسی کنید ، همچنین با کمک پارچه ای خشک و نرم شارژر آنرا تمیز کتید.
✔ سرفیس خود را دوباره به پریز برق متصل کنید و مطمئن شوید که هیچ چیز دیگری مانند USB یا … به آن متصل نباشد.
✔ طراحی سرفیس به گونه ایست که به هنگام اتصال به برق ، بهترین عملکرد را ارائه میدهد.
✔ چراغ شارژر سرفیس را بررسی کنید :

• اگر چراغ LED روی شارژر خاموش است : وقتش رسیده که اتصالات باتری جدیدی خریداری کنید.
• اگر چراغ LED روی شارژر چشمک زن است : ابتدا پریز و نوسان برق را بررسی کنید اگر مشکلی نداشتند جهت اطمینان بهتر است اتصال باتری جدیدی خریداری کنید و قبل از بررسی یک تعمیرکار حرفه ای از استفاده از این اتصال خودداری کنید زیرا ممکن است باعث بوجود آمدن آسیبی جدی به دستگاه شود.
• اگر چراغ LED روی شارژر روشن است : اگر مشکلی در اتصالات شارژر باتری وجود نداشت ادامه مطلب را بخوانید.

راه حل اول : Press the power button

دکمه Power (برق) را یکبار فشار دهید و رها کنید ، اگر سرفیس شما روشن شد پس از آنکه باتری آن 40% شارژ شد ، آخرین بروزرسانی های ویندوز و سرفیس را نصب کنید.
✔ اگر شما کاربر سرفیس 3 هستید ممکن است باتری شما تخلیه شده باشد ، پس قبل از اینکه آنرا روشن کنید چند دقیقه صبر کنید تا باتری اندکی شارژ شود. بسته به میزانی که باتری شما تخلیه شده ، ممکن است نماد باتری را برای 10 تا 15 دقیقه بر روی صفحه ببینید.

راه حل دوم : waking your Surface with hotkeys

ممکن است سرفیس شما در حالت Sleep رفته باشد ، برای اینکه سرفیس را از حالت Sleep خارج کنید:
اگر صفحه کلیدتان به دستگاه متصل است : کلیدهای لوگوی ویندوز ( ) + Ctrl + Shift + B را همزمان فشار دهید.
اگر سرفیس شما در حالت Tablet فرار دارد : همزمان دکمه های افزایش صدا و کاهش صدا را 3 بار به فاصله زمانی 2 ثانیه فشار دهید.

 راه حل سوم : Force a restart

دکمه Power سرفیس خود را فشار دهید و برای 30 ثانیه نگه دارید. در این بین ممکن است تغییراتی در نمایشگر سرفیس مشاهده کنید ، آنها را نادیده بگیرید و تا پایان 30 ثانیه دکمه Power را رها نکنید. پس از اتمام 30 ثانیه دکمه Power را رها کرده و باری دیگر کلید پاور را برای روشن شدن دستگاه فشار داده و رها کنید.
✔ اگر سرفیس شما روشن شد پس از آنکه باتری آن 40% شارژ شد ، آخرین بروزرسانی های ویندوز و سرفیس را نصب کنید.


راه حل چهارم : Two-button shutdown (فقط برای Surface Pro و SurfaceBook)

✪مهم : از این روش برای Surface RT, Surface 2 یا Surface 3 استفاده نکنید و صرفا برای مدل هایSurface Pro و Surface Book استفاده شود.

مرحله اول : دکمه Power سرفیس خود را فشار دهید و برای 30 ثانیه نگه دارید سپس رها کنید.
مرحله دوم : همزمان دکمه های افزایش صدا و کاهش صدا را به مدت 15 ثانیه نگه دارید سپس رها کنید.
مرحله سوم : پس از انجام این دو مرحله ، 10 ثانیه صبر کنید.
مرحله چهارم : دکمه ی Power را یکبار فشار دهید و رها کنید تا سرفیس شما روشن شود.مشکل چشمک زدن آداپتور Surface Pro 4 به تازگی بین کاربران مطرح شده که برای خود ما هم این مشکل پیش اومد ما آداپتور ،کابل شارژ و تمام اتصالات برقی رو به دقت بررسی کردیم و متوجه اتصالی در کابل آداپتور شدیم! شما میتوانید با جدا کردن خار سرفیش آداپتور سرفیس پرو که در بالای قسمت استوانه ای سرفیش آداپتور قرار دارد سیم داخلی را براحتی بدون کوچکترین زحمتی بصورت کشویی بازکنید! اما برای باز کردن آداپتور اصلی سرفیس میبایست دست به آچار شوید و قطعی کابل را پیدا کرده و با ترمیم آن یا کوتاه تر کردن کابل مشکلتون حل کنید.
''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
