import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class connection_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<connection_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/kOGGCGAb2d4';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('اتصالی یا شورتی در مدار'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''علائم خرابی مادربرد
قبل از اینکه به شما نحوه تست مادربرد نشان دهیم برخی از علائم خرابی مادربرد را خواهیم گفت تا به شما در درک آن کمک کنیم.

آسیب فیزیکی قطعات
هنگامی که کامپیوتر خاموش است، می توانید مادربرد را به لحاظ فیزیکی بررسی کنید. معمولاً گرمای بیش از حد، جنس بد و قدیمی بودن خازن ها، می تواند منجر به نشت یا ترکیدگی آنها شود. اگر در خازنی ترکیدگی مشاهده می کنید، می تواند منجربه خرابی مادربرد شود.

بوی غیرعادی سوختگی
یکی از علائم بارز خرابی مادربرد بوی سوختگی است. معمولاً بوی سوختگی زیاد بدان معنی است که یک قطعه بیش از حد گرم شده است. بعضی اوقات ، گرمای بیش از حد یا خرابی می تواند به وسیله یک قطعه ناسازگار ایجاد شود. به عنوان مثال ، یک کارت گرافیک یا رم ناسازگار می تواند باعث آسیب دیدن مادربرد شود.

نمایش منوی بایوس در هنگام راه اندازی
معمولاً برای ورود به منوی بایوس، باید بصورت دستی پیکربندی کنید. اگر این منو خود به خود و در طی فرایند راه اندازی ظاهر شود، نشان دهنده آن است که انبوهی از خطاهای نرم افزاری یا سخت افزاری مانند مشکل مادربرد وجود دارد. با توجه به اینکه منوی بایوس سازوکارهای سخت افزاری را برای کامپیوتر شما مدیریت می کند، برقراری ارتباط با قطعاتی که اخیراً روی مادربرد نصب شده اند؛ مانند کارت ویدیو برای مادربرد دشوار است، این منو در هنگام راه اندازی ظاهر می شود.

عملکرد بد برنامه ها
اگر مادربرد شما در حال خراب شدن باشد، قادر به مدیریت تمام قطعات سخت افزاری کامپیوتر نیست. که این ممکن است منجر به خاموشی های مکرر و لگ در اجرای برنامه ها منجر شود.

قفل شدن های تصادفی یا مشکلات فریز شدن
یکی دیگر از علائم خرابی مادربرد این است که کامپیوتر شما بصورت تصادفی فریز یا قفل می شود. اگر متوجه شدید کامپیوتر فریز می شود، باید عیب یابی کنید و ببینید مشکل نرم افزار دارید یا خیر. اگر احتمال مشکل نرم افزار را رد کرده اید، سایر قطعات سخت افزاری را نیز در نظر بگیرید، مانند احتمال خراب بودن مادربرد.

سایر علائم خرابی مادربرد
لوازم جانبی شناسایی نمی شوند یا وقتی شناسایی می شوند برای چند ثانیه یا بیشتر عملکرد سیستم را متوقف می کنند.
برای انجام تسک ها در کامپیوتر مدت زمان زیادی طول می کشد.
کامپیوتر درایورهای فلش را تشخیص نمی دهد و مانیتور خطوط عجیبی را نشان می دهد (به خصوص وقتی که از کارت گرافیک روی مادربرد استفاده می کنید).
مادربرد خودآزمایی هنگام روشن شدن را (POST) انجام نمی دهد.

چگونه بفهمیم مادربرد سوخته است
پس از فشردن دکمه پاور، اگر POST موفقیت آمیز نباشد و کامپیوتر به هیچ وجه روشن یا بوت نشود، خرابی سخت افزار تقریباً قطعی است. اما این بدان معنی نیست که مادربرد شما بد است زیرا PSU (واحد منبع تغذیه)، گرمای بیش از حد CPU و غیره نیز می توانند باعث این وضعیت شوند. شما باید چیز مهمی را بررسی کنید.

بررسی ظاهری سخت افزار
چگونه بفهمیم مادربرد شما خراب است؟ بررسی ظاهری اولین کاری است که باید انجام دهید.

یکی از دلایل اصلی خرابی مادربرد خازنهای بادکرده یا ترکیده است.  بالای هر خازن را بررسی کنید تا ببینید آیا نشانی از بادکردگی یا نشتی وجود دارد. اگر پاسخ بله بود، خازن ترکیده است. این حالت می تواند مسبب ایجاد هرگونه مشکلی در مادربرد باشد. در این شرایط شما باید خازن ها را تعویض کنید اما این امر مستلزم داشتن مهارت در لحیم کاری است.

بررسی PSU (منبع تغذیه)
در پاسخ به سوال اینکه چگونه مادربرد را تست کنیم؟ بررسی PSU نیز بسیار مهم است.

PSU به اندازه مادربرد مهم است اما اغلب کم ارزش یا حتی مورد غفلت قرار می گیرد. پاور می تواند به کامپیوتر شما برق بدهد اما اگر به درستی کار نکند یا مشخصات آن نادرست باشد، سیستم ممکن است دچار آسیب دائمی شود.. اگر بار روی PSU بیش از حد باشد، عدم جریان دهی کافی پاور به سیستم می تواند حتی به سایر قطعات آسیب برساند.

در صورت خرابی مادربرد چه باید کرد؟
بعد از اتمام عیب یابی و انجام تست های مادربرد، چنانچه متوجه شدید که مادربرد خراب است، چه کاری باید انجام دهید؟

شما می توانید برای تعمیر مادربرد خودتان اقدام کنید. اما باید بدانید که این کار ساده ای نیست و نیازمند دانش پایه ای در مورد قطعات الکتریکی مانند خازن ها است و خطر برق گرفتگی نیز وجود دارد. ما در تعمیرکارسلام به شما پیشنهاد میکنیم با ثبت سفارش تعمیر اینکار را به متخصصین فنی بسپارید.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
