import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class motherboard_voltage_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<motherboard_voltage_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/-ainoykqalE';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('ولتاژگیری و تست مادربرد'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''وقتی شما نه باطری به دستگاهتون وصله  و نه شارژر و نه باطری بکاپ، پس توی مادربرد هیچ ولتاژی نیست . وقتی شما سوکت شارژ رو وصل میکید ،ولتاژ وارد دستگاه میشه . از سوکت ولتاژ جریان پیدا می کنه و به تمام قطعات میرسه . مثلا روی کلید پاور . سی پی یو و هر قطعه ای که روی مدار باشه . 

برای ولتاژ گیری بهتره یک اهمتر دیجیتال داشته باشید . اگه اتو رنج باشه خیلی بهتر . شما کلید اهمتر رو روی قسمتی که DC نوشته میزارید . همیشه به یاد داشته باشید برای ولتاژ گیری باید پراپ مشکی اهمتر به قسمت فلزی مادربرد وصل باشه . مثل جای پیچ ها یا بدنه USB و یا هر جای دیگری که بدنه ی دستگاه ( مادربرد ) باشه . 

همونطور که میدونید ولتاژ ورودی دستگاه 19 تا 21 ولت DC هستش . البته دستگاه ها با هم فرق داره . 
این ولتاژ به یک ایسی اصلی میرسه به نام ایسی تغذیه . قبل این ایسی باید شما رو سلف هاتون یا خازن ها و موسفت ها ولتاژ 19 رو داشته باشید . این ایسی 19 ولت ورودی داره . و با توجه به دیتاشیت ان میتونید پایه های ورودی رو چک کنید که 19 رو داره یا نه . اگه داشت یعنی تا اونجا همه چی اکی هستش . این ایسی 19 رو به 3.3 ولت و 5 ولت تقسیم میکنه که شما با توجه به دیتاشیت باز هم میتونید ایسی رو چک کنید . 

یک سری استاندارد ها هست مثلا روی کلید پاور باید 3.3 ولت باشه . برای این منظور پراپ مشکی به بدنه مادربرد و پراپ قرمز به پایه های این کلید وصل کنید . روی یکی باید اهمتر به 3.3 ولت رو نشون بده . 


پس اگه 3.3 بود یعنی ولتاژ کلید پاور رو دارین . 

در مثال دیگر روی IC I/O باید هم 3.3 و هم 5 رو داشته باشید .


بدین صورت که پراپ مشکی روی بدنه مادربرد و پراپ قرمز رو باید روی پایه های ایسی بزارید و ولتاژ ها رو چک کنید . یه وقت هایی میشه وقتی پراپ قرمز رو پایه ای میزارید ولتاژ عجیبی رو به شما نشون میه . مثلا 50 مگا ولت یا …. . به خاطر اینه که اون پایه هم بدنه میباشد . یعنی شما پراپ قرمز رو هم به بدنه وصل کرده اید 
هر ایسی پایه یا پایه هایی داره که به بدنه وصل میشن  .(همون گروند خودتون)

 مثال دیگه ایسی بایوس هستش که باید 3.3 ولت رو داشته باشه . پراپ مشکی به بدنه مادربرد و قرمز به پایه های ایسی که باید 3.3 ولت رو بهتون اهمتر نشون بده . 
 
 یک سری استاندارد ها رو براتون میزارم که باید این ولتاژ ها رو روی این ها چک کنید . 

 

Usb = 5 v . هم سوکت ها هم ایسی مربوطه

Ps2 = 5 v هم سوکت ها هم ایسی مربوطه

Com = 10 v هم سوکت ها هم ایسی مربوطه

Ic sound =این آی سی باید ولتاژ2.5 رو روی پایه های 35 و 36 داشته باشه

1394 = 3/3 v

Osc i/o = 3.3 – 1/9 v ( کریستال کنار I/O )

Osc s.b = 1/9 – 1/27 v ( کریستال کنار S.B ) 

Osc ic clock = 1/2 – 1/9 v کریستال اصلی 

Vga = 1/5 v روی ترانزیستور های اطراف

Hi voltag = 3/3 – 5 * max v

Ram = 2/5 روی پایه های رم 
 


در پایه کریستال که شماره14/38 روی آن نوشته 
اگر ولتاژ1/2 یا 1/9 نداشت ای سی کلاک ایراد دارد 

این یعنی ولتاژ گیری . حالا اگه ولتاژی نباشه باید دنبال قطعه ای که سوخته باشید . 

اگه هیچ جای مادربرد 3.3 و 5 رو نداشتید ببینید ایا ورودی 19 ولت رو دارین از شارژر . اگه داشتید و ولتاژ تا ایسی تغذیه رفته بود و خروجی نمیداد مشکل ایسی تغذیست .
اگه قبل ایسی تغذیه ( پایه های ورودی ولتاژ ) 19 ولت رو نداشتید فیوز های ورودی ولتاژ از شارژر ، سلف ها و خازن ها و مقاومت ها و موسفت ها باید چک بشه . معمولا با نگاهی دقیق میشه قطعه معیوب رو پیدا کرد .البته یک سری مقاومت ها هستند که مثل فیوز عمل میکنند و معمولا روشون نوشته 000 . 

یک راهی که معمولا واسه من جواب میده اینه : 

یک ترانس داشته باشید با ولتاژ کمتر از 19 ولت ولی امپر بالاتر از اداپتور لپتاپ . منبع اگه داشته باشید که تا 5 امپر بده خوبه . به دستگاه مثلا 11 ولت با امپر بالاتر وصل کنید قطعه سوخته داغ میشه و دود میکنه . فقط سریع باید انجام بشه . نه که بزارین و برین . 

نکته ***** = وقتی شما سوکت شارژر رو وصل میکنید حتما به چراغ شارژر روی لپتاپ توجه کنید . چون روشن شدن یا نشدنش خیلی مهمه . اگه روشن بشه ولی دستگاه پاور نشه و 3.3 ولت کلید پاور هست احتمال عیب تو مدار پاور دستگاه کم میشه . بیشتر برین سراغ بایوس و کریستال و کلید پاور . البته تجربه بندست . 

اگه روشن نشد ایراد از تغذیه دستگاهه . خاموشی کامل یعنی سوختگی و قطعی ولتاژ در مدار . روشن شدن و سریع خاموش شدن یعنی اتصال شدن قطعه ای در مدار به قول خودمون شورتی کردن . 

وقتی روی مادربرد اثری از سوختگی نمیبینید سریعا نرید دنبال دراوردن قطعه . با تینر بشورین و یه هیت نرم روی ان بگیرید . شاید لحیم سردی باشه . 

البته تجارب برای هر کسی زیاده . ولی با ولتاژ گیری میتونید جلو بیفتید . نقشه خوانی هم خیلی کمک میکنه بهتون . نقشه خوانی راحته . فقط حوصله میخواد . میتونید راحت بفهمید که ولتاژ از چیا رد میشه تا به کلید پاور برسه . وقتی 3.3 ولت رو کلید پاور نباشه چه قطعاتی تو مسیرش هست که احتمال سوختنش هست و با نقشه میتونید راحت تر پیدا کنید . 

معمولا جریان کشیدن توسط دستگاه که با منبع قابل مشاهده هست به خاطر داغ شدن قطعه ایست که سوخته . و اگه دستی به برد بکشید میتونید داغی رو احساس کنید . 

البته یه چی هم بهتون بگم : 

شاید براتون پیش اومده قطعه ای داره شدیدا داغ میکنه . و حتی با تعویض اون هم مشکل بر طرف نمیشه و باز داغ میکنه . اگه توجه کرده باشی اگه اون قطعه رو از مدار خارج کنید قطعه دیگری شروع به داغ کردن میکنه . و شاید چندین تا قطعه رو در بیارید و باز هم قطعه دیگری داغ کنه . 

این به خاطر اینه که یه قطعه ای شورتی کرده و داره ولتاژ رو رد میکنه از خودش و باعث داغی قطعات بعدی میشه . 

من خودم انقدر قطعات و در میارم تا به آخرین قطعه برسم . وقتی اصلی رو پیدا کنید ( یعنی با برداشتن اون دیگه قطعه ای داغ نکنه ) با تعویضش مشکلتون برطرف میشه . 
 

نکته***** = برای کار روی مدار حتما باطری بکاپ رو دربیارد . یه اتصالی کوچیک میتونه بایوس رو خالی کنه و باید پروگرامش کنید .

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
