import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class network_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<network_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/sOrM3wF6Yoc';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('مشکلات شبکه'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''علت وصل نشدن لپ تاپ به اینترنت در ویندوز ۷
اگر ویندوز لپ تاپ شما ۷ است، از جمله دلایل وصل نشدن لپ تاپ به اینترنت می‌تواند نرم افزارهای خاص امنیتی، مثل آنتی ویروس‌ها و فایرفال‌ها باشد. در این شرایط برای حل مشکل مراحل زیر را انجام دهید.

آنتی ویروس یا فایروال را به طور موقت قطع کنید.
اگر پس از قطع آنتی ویروس مشکل وصل نشدن لپ تاپ به اینترنت برطرف شد، یک آنتی ویروس دیگر روی لپ تاپ‌تان نصب کنید.
ولی در صورتیکه مشکل برطرف نشد، مسیر Setting/Network&Internet/WiFi را طی کنید.
به شبکه متصل شوید، سوییچ Set as Metered Conection را غیرفعال کنید.
کامپیوتر را یکبار ری استارت کرده و مجدد به شبکه وصل کنید.

چرا لپ تاپ به وای فای وصل می‌شود ولی اینترنت ندارد؟
اگر چند دستگاه به وای فای وصل هستند و مشکلی ندارند و لپ تاپ به وای فای وصل می‌شود ولی اینترنت ندارد، مشکل از تنظیمات اشتباه لپ تاپ است. برای حل مشکل کارهای زیر را به ترتیب انجام دهید:

ری بوت کردن لپ تاپ
ری بوت کردن مودم و روتر
راه اندازی ترابل شوتر ویندوز
بررسی آدرس IP
بررسی وضعیت ISP
امتحان کردن دستورات کامند پرامپت
غیرفعال کردن نرم افزار امنیتی
به روز رسانی درایورهای وایرلس
ری استارت کردن شبکه

علت وصل نشدن کامپیوتر به اینترنت با کابل چیست؟
یکی دیگر از دلایل وصل نشدن لپ تاپ و کامپیوتر به اینترنت، مشکل در کابل است. اگر کامپیوتر با کابل، به اینترنت وصل نمی‌شود، مراحل زیر را انجام دهید:

از سلامت کابل مطمئن شوید.
در صورتی که مشکل در کابل نبود، از ترابل شوتر ویندوز استفاده کنید.
اگر خروجی کابل شبکه بیش از یکی است، آنها را بررسی کنید.
در صورتی که مشکل وصل نشدن دستگاه با کابل، همچنان ادامه دارد، طبق روشی که در ادامه مطرح می‌کنیم، مشکل را برطرف کنید.

مودم را یک بار خاموش و روشن کنید.
مسیر زیر را طی کنید.
 Control Panel>Network and Internet>Network and Sharing Center>Change adapter settings

وقتی مسیر فوق را طی کردید، بررسی کنید، Local Area Connection وصل است یا خیر.
چنانچه وصل بود، آن را تغییر وضعیت دهید و یکبار قطع و پس از چند دقیقه وصل کنید تا مشکل برطرف شود.

دلایل وصل نشدن لپ تاپ به اینترنت
 دسته بندی : لپ تاپ و کامپیوتر 22 شهریور 1400 3710 بازدید زمان مطالعه 6 دقیقه ارسال دیدگاه

یادداشت ویراستار: اصل این مطلب در فروردین ۱۳۹۸نوشته شده بود و در شهریور ۱۴۰۰ دوباره بررسی و به‌روز شده است. همچنین این مطلب در آذر ۱۴۰۰ توسط کارشناسان لپ تاپ و کامپیوتر آچارباز، بررسی و تایید شده است.
لپ تاپ‌ها یکی از وسایل بسیار ضروری شخصی هستند که در قرن حاضر برای بسیاری از امور روزانه اشخاص مورد استفاده قرار می‌گیرند.کم حجم بودن لپ تاپ‌ها از ویژگی‌های خوب آن‌هاست که می‌تواند کمک کند آن‌ها را همیشه همراه داشته باشید. همچنین بسیاری از کارها مانند امور اداری، ایمیل، شبکه‌های اجتماعی، تکالیف مدرسه، کارهای هنری و حتی جزئی‌ترین کارها به کمک آنها انجام دهید. حال اگر لپ تاپ به اینترنت وصل نشود، پس نیمی از کارایی خود را از دست می‌دهد.

ما در این مقاله آچارباز قصد داریم دلایل وصل نشدن لپ تاپ به اینترنت را آموزش دهیم. همچنین اقدامات لازم برای رفع مشکل و تعمیر لپ تاپ را به شما بگوییم، پس در ادامه با ما همراه باشید.

علت وصل نشدن لپ تاپ به اینترنت در ویندوز ۷
چرا لپ تاپ به وای فای وصل می‌شود ولی اینترنت ندارد؟
علت وصل نشدن کامپیوتر به اینترنت با کابل چیست؟
علت وصل نشدن لپ تاپ به وای فای چیست؟
چرا اینترنت کامپیوتر وصل است ولی صفحه باز نمی‌شود؟
مشکل وصل نشدن اینترنت گوشی به کامپیوتر؛ وصل نشدن لپ تاپ به هات اسپات گوشی
علت وصل نشدن لپ تاپ به اینترنت در ویندوز ۷
اگر ویندوز لپ تاپ شما ۷ است، از جمله دلایل وصل نشدن لپ تاپ به اینترنت می‌تواند نرم افزارهای خاص امنیتی، مثل آنتی ویروس‌ها و فایرفال‌ها باشد. در این شرایط برای حل مشکل مراحل زیر را انجام دهید.

آنتی ویروس یا فایروال را به طور موقت قطع کنید.
اگر پس از قطع آنتی ویروس مشکل وصل نشدن لپ تاپ به اینترنت برطرف شد، یک آنتی ویروس دیگر روی لپ تاپ‌تان نصب کنید.
ولی در صورتیکه مشکل برطرف نشد، مسیر Setting/Network&Internet/WiFi را طی کنید.
به شبکه متصل شوید، سوییچ Set as Metered Conection را غیرفعال کنید.
کامپیوتر را یکبار ری استارت کرده و مجدد به شبکه وصل کنید.
یکی از علت‌هایی که ویندوزهای قدیمی به اینترنت وصل نمی‌شود، قدیمی شدن درایورهای شبکه است.
چرا لپ تاپ به وای فای وصل می‌شود ولی اینترنت ندارد؟
اگر چند دستگاه به وای فای وصل هستند و مشکلی ندارند و لپ تاپ به وای فای وصل می‌شود ولی اینترنت ندارد، مشکل از تنظیمات اشتباه لپ تاپ است. برای حل مشکل کارهای زیر را به ترتیب انجام دهید:

ری بوت کردن لپ تاپ
ری بوت کردن مودم و روتر
راه اندازی ترابل شوتر ویندوز
بررسی آدرس IP
بررسی وضعیت ISP
امتحان کردن دستورات کامند پرامپت
غیرفعال کردن نرم افزار امنیتی
به روز رسانی درایورهای وایرلس
ری استارت کردن شبکه
به احتمال قوی با انجام کارهای فوق مشکل وصل نشدن لپ تاپ به اینترنت برطرف شده و لپ تاپ به وای فای وصل می‌شود. اما چنانچه بازهم لپ تاپ به WiFi وصل نشد، باید از تعمیرکار کامپیوتر برای تعمیر لپ تاپ خود کمک بگیرید.

تعمیر لپ تاپ در محل با آچارباز
سرویس تعمیر لپ تاپ در محل آچارباز یک تعمیرگاه سیار آنلاین کامپیوتر است که کار آن عیب یابی و رفع ایراد تمامی سیستم‌های لپ تاپ است. در صورت بروز مشکلات نرم افزاری و سخت افزاری، کافیست در اپلیکیشن خدمات سیار آچارباز، درخواست تعمیرکار سیار لپ تاپ را ثبت کنید.
درخواست تعمیر لپ تاپ
علت وصل نشدن کامپیوتر به اینترنت با کابل چیست؟
یکی دیگر از دلایل وصل نشدن لپ تاپ و کامپیوتر به اینترنت، مشکل در کابل است. اگر کامپیوتر با کابل، به اینترنت وصل نمی‌شود، مراحل زیر را انجام دهید:

از سلامت کابل مطمئن شوید.
در صورتی که مشکل در کابل نبود، از ترابل شوتر ویندوز استفاده کنید.
اگر خروجی کابل شبکه بیش از یکی است، آنها را بررسی کنید.
در صورتی که مشکل وصل نشدن دستگاه با کابل، همچنان ادامه دارد، طبق روشی که در ادامه مطرح می‌کنیم، مشکل را برطرف کنید.

مودم را یک بار خاموش و روشن کنید.
مسیر زیر را طی کنید.
 Control Panel>Network and Internet>Network and Sharing Center>Change adapter settings

وقتی مسیر فوق را طی کردید، بررسی کنید، Local Area Connection وصل است یا خیر.
چنانچه وصل بود، آن را تغییر وضعیت دهید و یکبار قطع و پس از چند دقیقه وصل کنید تا مشکل برطرف شود.
در صورتیکه با انجام مراحل فوق مشکل برطرف نشد، بهتر است از افراد زبده و ماهر در بخش تعمیر مودم آچارباز کمک بگیرید.

علت وصل نشدن لپ تاپ به وای فای چیست؟
یکی دیگر از دلایل وصل نشدن لپ تاپ به اینترنت، مشکل در اتصالات، و کابل‌های مربوط به وای فای خانه است. اگر لپ تاپ به وای فای‌های دیگر متصل می‌شود و تنها به وای فای خانه وصل نمی‌شود، باید وای فای خود را ریست کنید. برای این کار، ابتدا همه‌ی کابل‌های متصل به اینترنت را جدا کنید. یک دقیقه صبر کنید، دوباره کابل‌ها را وصل کنید.
مسئله‌ی دیگر که سبب وصل نشدن لپ تاپ به WiFi می‌شود، خرابی اینترنت از مرکز ارائه دهنده سرویس اینترنت است. در صورتیکه آیکون اتصال به اینترنت را روی صفحه‌ مانیتور مشاهده می‌کنید، ممکن است اتصال به کارت شبکه لپ تاپ مشکل داشته باشد.
از جمله دلایل وصل نشدن لپ تاپ به وای فای، اشکال در تنظیمات مودم است. برای حل این مسئله، می‌توانید از تغییر نام وای فای کمک بگیرید.
تنظیمات کاهش مصرف برق و PowerPlan نیز از جمله مشکلاتیست که سبب وصل نشدن لپ تاپ به وای فای می‌شود. زیرا روشن بودن تنظیمات کاهش مصرف برق، سبب خاموش شدن وای فای برای ذخیره انرژی می‌شود.

چرا اینترنت کامپیوتر وصل است ولی صفحه باز نمی‌شود؟
اگر اینترنت کامپیوتر وصل است ولی صفحه باز نمی‌شود می‌توانید روش‌های زیر را پیاده کنید:

از وصل بودن اینترنت مطمئن شوید

برای مطمئن شدن از وصل بودن اینترنت مراحل زیر را انجام دهید:

کلید ترکیبی (win+R) را فشار دهید.
در پنجره باز شده عبارت CMD را تایپ کنید.
پس از باز شدن پنجره CMD عبارت ping 4.2.2.4 را تایپ کرده و اینتر بزنید.
در پاسخ باید ۴ بار جمله‌ای که شامل کلمات  (..reply 4.2.2.4) است را دریافت کنید. این جمله به معنای اتصال به اینترنت است.
اما اگر پاسخ (request timed out) بود، یعنی دستگاه به اینترنت متصل نیست.
ورود به تنظیمات اینترنت (Internet options)

گاهی ممکن است تنظیمات شبکه بهم بریزد و صفحه‌ای باز نشود. برای حل این مشکل باید از طریق منوی اینترنت اکسپلور یا کنترل پنل ویندوز وارد تنظیمات Internet options شوید و تنظیمات را به حالت اول بازگردانید.


استفاده از Troubleshooter
اولین اقدام برای حل آن، استفاده از (Troubleshooter) است. برای استفاده از قابلیت Troubleshooter مراحل زیر را طی کنید:

وارد منوی Start شوید.
مسیر Settings>Update & Security را طی کنید.

در پنل سمت چپ روی گزینه Troubleshoot  کلیک کنید.وارد  Internet Connectionsشوید.
روی گزینه Run the Troubleshooter کلیک کنید.
منتظر بمانید تا مشکل اتصال‌های شبکه به صورت خودکار بررسی و برطرف شود.


استفاده از Open Network
در صورتی که مشکل وصل نشدن لپ تاپ به هات اسپات گوشی برطرف نشد، می‌توانید راه Open Network را امتحان کنید.

ابتدا وارد  Settings>Network & Internetشوید.
وارد گزینهMobile Hotspot  شوید.
روی  Set up Mobile Hotspotکلیک کرده و گزینهConfirm  را تأیید کنید.
دوباره به هات اسپات گوشی وصل شوید.



باز گرداندن نسخه‌ی قبلی درایور شبکه
گاهی کامپیوتر قبل از آپدیت نسخه درایور، بدون مشکل، به اینترنت وصل می‌شود، ولی بعد از بروز رسانی درایور، این مشکل مجدد خودنمایی می‌کند. در این شرایط، برای بازگرداندن نسخه‌ی قبلی درایور، باید مراحل زیر را طی کنید:

وارد منوی Start شوید.
گزینه Device Manager را انتخاب کنید.
روی Network Adapters راست کلیک کنید.
در فهرست ظاهر شده روی گزینه Properties بزنید.
وارد بخش Driver شده و گزینه Roll Back Driver را انتخاب کنید.
در این زمان درایور به نسخه قبلی باز می‌گردد.

تغییر فرکانس WiFi
یکی دیگر از دلایل وصل نشدن لپ تاپ به اینترنت، فرکانس وای فای است. این مشکل زمانی پیش می‌آید، که گوشی شما اینترنت را از طریق باند ۵ گیگاهرتزی به اشتراک می‌گذارد. در این زمان باید فرکانس را از ۵ به ۲.۴ گیگا هرتزی تغییر دهید.

نحوه ریست کردن تنظیمات شبکه در گوشی
داخل تنظیمات گوشی خود شوید.
در فهرست ظاهر شده روی عبارت General Management  کلیک کنید.
گزینه Reset  را انتخاب کنید.
در منوی باز شده روی عبارت Reset Network Settings بزنید.
انتخاب این گزینه، تمامی شبکه‌های ذخیره شده و … پاک می‌شوند.
نحوه ریست کردن تنظیمات شبکه در ویندوز
اگر با ریست کردن تنظیمات شبکه گوشی همراه، مشکل وصل نشدن کامپیوتر به اینترنت گوشی برطرف نشد، تنظیمات شبکه در ویندوز را ریست کنید. برای ریست کردن تنظیمات شبکه در ویندوز لپ تاپ باید مراحل زیر را طی کنید:

به بخش Setting ویندوز بروید.
گزینه Network & Internet را انتخاب کنید.
وارد تنظیمات دستگاه شده و گزینه Network Reset را انتخاب کنید.
پنجره‌ی دیگری برای شما باز خواهد شد که در آن Reset Now را انتخاب کنید.
با انتخاب این گزینه ریست کردن ویندوز لپ تاپ شروع می‌‌شود.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
