import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class cpu_pwm_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<cpu_pwm_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/zDxFbAhu4Bo';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('CPU PWM'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''تحلیل و بررسی قسمت تغذیه CPU و مدارات PWM

از مدارات PWM جهت تامین ولتاژ مصرفی CPU ، RAM و تغذیه کارت گرافیک و غیره نیز از این روش استفاده می‌شود. یک مادربرد می تواند از چندین فاز تشکیل شده باشد که هر فاز دارای یک سلف 2 یا 3 ماسفت ، خازن و IC کنترلر ‏PWM (تمامی فازها را راه اندازی و کنترل می‌کند) می باشد. این روش اتلاف توان بسیار پایین و دقت ولتاژهای تولید شده بسیار بالا دارد و کنترل ولتاژ هم راحت هستش

‏PWM یا Pulse Width Modulation به معنای مدولاسیون عرض پالس می باشد یعنی با استفاده از خاصیت عرض پالس و نسبت زمان روشن بودن فاز به نسبت زمان خاموش بودن پالس می توان ولتاژ خروجی را تحت کنترل داشته و به مقدار دلخواه کم و زیاد کنیم.

اجزای یک مدار تغذیه PWM

کنترلر PWM یک IC است که وظیفه آن کنترل و نظارت بر خروجی تعیین عرض پالس و تولید پالسPWM  می باشد که می توانید آن را در مدارات نزدیک به CPU پیدا کنید در اطراف این IC مقاومت ها و خازن های SMD بسیاری زیادی وجود دارند که به همراه ماسفت ها ،خازنها و سلف ها مدار PWM با فازهای مختلف را تشکیل می دهند

درایور ماسفت

چون IC کنترلر ما قادر به تامین جریان مورد نیاز ماسفت ها جهت درایو کردن آنها نیست در نتیجه همیشه از یک IC یا یک ماسفت جهت راه اندازی ماسفت ها استفاده می کنند این ماسفت یا IC جریان مورد نیاز هر فاز را جهت راه اندازی تامین می کند و با IC کنترلر ما ارتباط مستقیم دارد

درایور ماسفت ها ممکن است هم به صورتIC  های 8 پایه که در شکل پایین نمایش دادیم باشد و یا ممکن است از یک ماسفت جهت درایو کردن دیگر ماسفت ها استفاده کنند ، در این روش معمولا از دو ماسفت در هر فاز استفاده می شود یکی از مزایای این روش این است که اتلاف توان بسیار پایین می آید ، در هر سیکل و در هر لحظه فقط یک فاز روشن می باشد و بقیه فازها خاموش هستند.

خازن و سلف

چون در این روش تولید ولتاژ فرکانس کاری منبع تغذیه بسیار بالا می باشد معمولا چیزی حدود ۱۰ گیگاهرتز در نتیجه برای یکسو سازی این ولتاژ دیگر نمی شود از خازنهای صافی استفاده کرد و بهترین روش برای یکسو سازی و حذف ریپل استفاده از سلف و خازن به صورت سری و موازی است

ولتاژ تغذیه IC و ماسفت های درایور

ولتاژهای مهم در مدار تغذیه CPU ولتاژ تغذیه IC و ماسفت های درایور ولتاژ ۱۲ ولت هستش که از طریق سوکت ۴ یا 8 پین وارد مدار PWM می‌شود البته ولتاژ تغذیه IC کنترلر ما می تواند متفاوت باشد برای مثال برای IC کنترلر ISL6366 ولتاژ تغذیه برابر با ۵ ولت است که ولتاژ درایور گیت آن نیز برابر با ۵ می باشد ولی ولتاژی که بر روی درین ماسفت درایور قرار می گیرد برابر با ۱۲ ولت است گیت ماسفت درایور با سیگنال اعمالی از IC کنترلر که برابر با ۵ ولت است در زمان های تعیین شده روشن و خاموش می شود و به همین ترتیب ماسفت های فاز نیز روشن و خاموش می شود

در مادربرد می توانیم از چندین فاز استفاده کنیم که هر فاز شامل یک سلف و خازن و 2 یا 3 ماسفت و یک درایور ماسفت می‌باشد به همین ترتیب در یک لحظه فقط یک فاز روشن و بقیه فازها خاموش می باشد به همین دلیل است که افزایش تعداد فازها عمر مادربرد و راندمان را افزایش می دهد زمانی که CPU را بر روی سوکت قرار می‌دهیم و مادربرد را استارت کنیم بلافاصله CPU یک سیگنال تحت عنوان VID  را به سمت IC کنترلر ‏ PWM می فرستد بایوس این سیگنال و اطلاعات آن را می خواند در صورتی که مشخصات سیگنال ارسال شده توسط بایوس مادربرد ساپورت شود از طریق بایوس دستور تولید ولتاژ vcore داده می شود ، تولید vcore درCPU  های مختلف متفاوت است از ۱.۲ ولت تا ۱.۶ متغیر است . عملیات شناسایی CPU توسطPOST انجام می شود حال اگر پایه های سوکت CPU کثیف یا شکسته باشد و یا هر دلیلی سیگنال VID اشتباه ارسال شود ممکن است CPU به درستی درایو نشود.

IC ISL6334 به عنوان کنترلر PWM استفاده شده است این IC قادر است تا 4 فاز را به صورت همزمان کنترل نمایند

این IC دارای ۴۰ پین و یک پین در وسط و زیر IC که GND است دارای7 پین جهت اعمال سیگنال VID از سوی CPU می باشد

CPU با ارسال VID در واقع به IC کنترلر فرمان ساخت ولتاژ Vcore مورد نیاز خود را می دهد در واقع با ارسال دیتا به صورت دیجیتالی و به صورت منطق 0 و 1 و از سوی CPU ، IC ISL6334 قادراست تا مقدار دقیق ولتاژ vcore را تولید نمایند

بخشی از جدول مربوط به کد های VID دریافتی و ولتاژ ساخته شده توسط آن را ملاحظه می کنید در صورتی تمایل می توانید دیتاشیت این IC را دانلود و جدول کامل آن را مطالعه نمایید برای مثال برای ساخت ولتاژ 1.55625 ولت باید پین هایVID  به صورت زیر صفر و یک منطقی باشند.

منظور از صفر و یک منطقه سطح ولتاژ می‌باشد در دیجیتال معمولا ولتاژهای کمتر از ۲ ولت را به صورت صفر منطقی و ولتاژ های بیشتر از ۳ ولت را به صورت یک منطقی در نظر می‌گیرد حداکثر سطح ولتاژ در منطق دیجیتال معمولا ۵ ولت می باشد حال ممکن است در طراحی های مختلف از سطح ولتاژهای مختلفی استفاده کنند

کاربرد پین های VID و نحوه ساخت دقیق ولتاژ توسط IC کنترلر را فهمیدیم آن باید مداراتی که به این IC متصل می‌شوند را بررسی نماییم

در شکل یک مدار Sample جهت ساخت ولتاژ مورد نیاز را ملاحظه می کنید این مدار حداقل IC ها و قطعات مورد نیاز را آورده که در اینجا به بررسی وظایف هر یک از آنها خواهیم پرداخت

‏ VCCاین پین برای تغذیه IC می باشد که برابر با ۵ ولت است.

GND به زمین مدار و مادربرد وصل می شود

VTT برای فعال سازی یا غیر فعال کردن IC این ولتاژ چیزی حدود 0.85 می باشد که از مادربرد جهت روشن کردن IC استفاده می شود در صورت نبودن این ولتاژ Vcore تولید نخواهد شد

VR_FAN به مدارات حسگر برای شناسایی مقدار دما و کنترل دور فن استفاده می شود

‏VR-HOT به مدارات حسگر برای شناسایی مقدار دمای بیش از کنترل دور فن استفاده می شود

‏VID 1 تا VID 7  به CPU متصل می‌شود تا دیتای مربوط به VID را دریافت کنند

EN-PWR این هم همانند پین EN-VTT جهت فعال و غیرفعال سازی IC مورد استفاده قرار می گیرد و هر ولتاژ بیشتر از 0.85 بود به آن اعمال شود IC روشن خواهد شد معمولا به ۱۲ ولت متصل می شود

TCOMP جهت ساخت یک ولتاژ مبنا برای حسگرهای دما مورد استفاده قرار می گیرد

TM این پین به یک مقاومت حساس به حرارت متصل می‌شود از این مقاومت برای کنترل و اندازه گیری مقدار دما استفاده می شود و با استفاده از آن IC ISL6334  مقدار VR-FAN و  VR-HOTرا تغییر می دهد

PWM1 تاPWM4  این چهار پین خروجی‌های سیگنال PWM ساخته شده توسط IC های ISL6334 می باشد این سیگنال ها تولید شده توسط پالس‌های PWM می باشد که باید به درایور ماسفت متصل شوند چون قدرت سیگنال تولید شده توسط IC کم بوده و قدرت کافی جهت درایو کردن ماسفت های قدرت را ندارند از همین جهت از درایور ماسفت استفاده می شود.

-ISEN, +ISEN به مدارات حسگر جریان در خروجی متصل می شود تا در صورت رخ دادن اتصال کوتاه و یا جریان کشی بیش از حد از مدار محافظت نموده تا به مدارت و IC آسیب وارد نشود علت این که از 2 پین استفاده شده است این است که ISL6334 جهت مقایسه جریان خروجی از آپ امپ استفاده می کند

درایورهای ماسفت

از آی سی isl6612 جهت درایو کردن ماسفت ها استفاده شده است شکل ظاهری این آیسی و ترتیب پین های آن را ملاحظه نمودید آن زمان بررسی مدارات این‌ ای‌سی است

بررسی پین های این IC

VCC این پین به تغذیه ۱۲ ولت متصل می شود

PVCC این پین نیز همانند پین VCC باید به تغذیه ۱۲ ولت متصل شود

‏BOOT این پین به توسط خازن بوت استرپ به پین فاز متصل می شود

UGATE جهت کنترل گیت ماسفت بالایی مورد استفاده قرار می گیرد و به پین گیت ماسفت بالایی متصل می شود

LGATE جهت کنترل کیفیت پایینی مورد استفاده قرار می گیرد و به گیت ماسفت پایینی وصل می شود همانطور که می دانید برای روشن خاموش کردن ماسفت ها از گیت آنها برای تحریک و روشن نمودن آنها استفاده می کنند با اعمال یک ولتاژ مناسب به گیت دریچه درین و سورس متناسب با ولتاژ اعمال شده باز می شود ، در ماسفت های سوئیچ با اعمال ولتاژ به گیت ، درین و سورس همانند یک کلید بسته با کم ترین اهم ممکن به یکدیگر وصل می شوند

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
