import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class transistor_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<transistor_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/J4oO7PT_nzQ';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('ترانزیستور'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''
ترانزیستور یک وسیله نیمه هادی است که معمولاً در تقویت کننده ها یا کلیدهای کنترل الکترونیکی استفاده می شود. این قطعه اساسی، همانند بلوک ساختمان است که عملکرد رایانه ها، تلفن های همراه و سایر مدارهای الکترونیکی مدرن را تنظیم می کند. با توجه به زمان پاسخ سریع و دقت بالا، ترانزیستورها را می توان برای انواع عملکردهای دیجیتال و آنالوگ از جمله تقویت، سوئیچینگ، تنظیم ولتاژ، مدولاسیون سیگنال و نوسان ساز استفاده کرد.
یک ترانزیستور معمولی از سه لایه مواد نیمه هادی یا به طور خاص ترمینال ها تشکیل شده است که به اتصال به مدار خارجی و انتقال جریان کمک می کند. ولتاژ یا جریانی که به هر یک از جفت ترمینال های ترانزیستور اعمال می شود، جریان را از طریق جفت پایانه های دیگر کنترل می کند.
سه پایانه BJT سورس، امیتر و کلکتور هستند. جریان بسیار کمی که بین سورس و امیتر جریان دارد می تواند جریان بزرگتری را بین کلکتور و پایانه امیتر کنترل کند.

علاوه بر این، دو نوع BJT وجود دارد. این شامل؛

ترانزیستور P-N-P: نوعی BJT است که در آن یک ماده از نوع n وارد شده یا بین دو ماده از نوع p قرار می گیرد. در چنین پیکربندی، دستگاه جریان جاری شده را کنترل می کند. ترانزیستور PNP از 2 دیود کریستالی تشکیل شده است که به صورت سری به هم متصل می شوند. سمت راست و سمت چپ دیودها به ترتیب به دیود پایه کلکتور و دیود پایه امیتر معروف هستند.

ترانزیستورN-P-N: در این ترانزیستور یک ماده از نوع p را پیدا می کنیم که بین دو ماده نوع n وجود دارد. ترانزیستور N-P-N اساساً برای تقویت سیگنال های ضعیف به سیگنال های قوی استفاده می شود. در ترانزیستور NPN، الکترون ها از امیتر به ناحیه کلکتور حرکت می کند و در نتیجه جریان در ترانزیستور تشکیل می شود. این ترانزیستور به طور گسترده در مدار استفاده می شود.
بیایید کار ترانزیستورها را بررسی کنیم. می دانیم که BJT از سه ترمینال سوررس، امیتر و کلکتور تشکیل شده است. در واقع، این یک دستگاه جریان محور است که در آن دو اتصال P-N در یک BJT وجود دارد.

یک اتصال P-N بین امیتر و ناحیه سورس و اتصال دوم بین کلکتور و ناحیه سورس وجود دارد. مقدار بسیار کمی شار جریان از طریق امیتر به پایه می تواند مقدار قابل قبولی شار جریان را از طریق دستگاه از امیتر به کلکتور کنترل کند.

در عملکرد معمول BJT، اتصال بیس-امیتر بایاس رو به جلو و اتصال بیس-کلکتور بایاس معکوس است. به عبارت دیگر، هنگامی که جریانی از اتصال بیس-امیتر می گذرد، جریانی در مدار کلکتور جریان می یابد.

برای توضیح عملکرد ترانزیستور، اجازه دهید یک نمونه از ترانزیستور NPN را مثال بزنیم. از همان اصول برای ترانزیستور PNP استفاده می شود با این تفاوت که حامل های جریان حفره هستند و ولتاژها معکوس می باشند.
چنین آزمایش ترانزیستور دو قطبی را می توان با تغییر مولتی متر به حالت اهم متر (تست مقاومت) یا با تغییر به تست دیود انجام داد. در حالت اول، سلکتور باید روی 2 کیلو اهم تنظیم شود. گام بعدی تعیین این است که آیا با ترانزیستور npn یا pnp سر و کار دارید – مستندات فنی می تواند در این مورد کمک کند. با فرض اینکه با یک نوع pnp سر و کار داریم و تصمیم داریم در حالت اهم متر تست کنیم، به صورت زیر عمل می کنیم:

پراب منفی مولتی متر را به خروجی پایه (معمولاً پروب سیاه رنگ) و مثبت (قرمز) را ابتدا به کلکتور و سپس به امیتر وصل کنید. بدست آوردن مقداری در محدوده ~500 -1500 اهم کارکرد صحیح ترانزیستور را تایید می کند.
پروب قرمز را به پایه و پروب مشکی را ابتدا به کلکتور و سپس به امیتر وصل کنید. برای یک ترانزیستور که به درستی کار می کند، مولتی متر باید نشان دهد که مقدار اندازه گیری شده خارج از محدوده مشخص شده است.
هر دو پروب مثبت و منفی، پین های ترانزیستور را که معادل کلکتور و امیتر هستند، لمس می کنند. نتیجه اندازه گیری شده باید 1 باشد، صرف نظر از اینکه ما یک پروب مثبت یا منفی را اعمال کرده ایم.
مقاومت را در هر دو جهت تست می کنیم. به دست آوردن نتیجه 1 در هر دو جهت (مقاومت به بی نهایت میل می کند) نشان دهنده معیوب بودن ترانزیستور است. قرائت صفر یا نزدیک به صفر به طور یکسان تفسیر می شود.
با فرض اینکه ترانزیستور ما از نوع npn است و تصمیم به آزمایش دیود داریم (چون این نوع ترانزیستور شبیه سیستمی با دو دیود موازی است)، ابتدا باید مولتی متر را به حالت مناسب تغییر دهیم، سپس دیود قرمز را به پایه وصل کنیم و سیاه را به امیتر. پس از این روش، مولتی متر باید یک مقدار ولتاژ DC خاص را بر روی صفحه نمایش خود نشان دهد، که باید با داده های موجود در اسناد فنی ترانزیستور آزمایش شده مقایسه شود. این برای تأیید این است که اندازه گیری به دست آمده بین حداقل و حداکثر تعیین شده توسط سازنده قطعه است. اگر چنین است، ترانزیستور به درستی کار می کند.

جدای از آزمایش های فوق برای عملکرد صحیح ترانزیستور، می توان بهره جریان را که با h21 نشان می دهد نیز اندازه گیری کرد، اما برای این منظور مولتی متر باید به یک سوکت مخصوص برای آزمایش چنین عناصری مجهز شود. در این صورت، دستگاه را به حالت hFE تغییر دهید، سپس پایانه های ترانزیستور را به سوکت های مناسبی که با علامت های B، E و C مشخص شده اند (پایه، امیتر، کلکتور) وصل کنید و مقدار بهره DC اندازه گیری شده را از صفحه LCD بخوانید.
''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
