import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class debuger_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<debuger_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/FkaacYKk_s0';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('انواع دیباگر ها'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''دیباگر چیست؟
اگر بخواهیم معنای لغوی دیباگر را مورد بررسی و واکاوی قرار دهیم؛ «باگ» به معنای عیب و ننگ، ایراد و اشکال می باشد. «دیباگ» به معنای ضد عیب و ضد اشکال یا ضد خطاست و «دیباگر» به معنای برطرف کننده عیب یا اشکال زدا می باشد. همین معنا و مفهوم از خود وسیله دیباگر در درون کامپیوترهای شخصی و لپ تاپ ها بر می آید.

دیباگر در pc و لپ تاپ از جمله قطعاتی است که مورد استفاده قرار می گیرد. تعمیرکار های حرفه ای که در حوزه تعمیرات لپ تاپ و کامپیوتر شخصی کار می کنند، اصولا با این قطعه مهم در لپ تاپ ها و کامپیوترهای شخصی آشنا هستند تا بتوانند عیب به وجود آمده در مادربرد لپ تاپ ها را برطرف نمایند . اما برای آنکه به کارآموزانی که به تازگی در صدد یادگیری آموزش تعمیرات لپ تاپ و کامپیوترهای شخصی هستند، بخواهیم این قطعه بسیار مهم را به آن ها معرفی سازیم، باید در ابتدای مراتب این قطعه را تعریف کرده و سپس پس از معرفی اجمالی، عملکرد آن را در دستگاه بیان سازیم.


معرفی کلی دیباگر در pc و لپ تاپ
دیباگر یک قطعه بسیار حساسی در کامپیوترهای شخصی و لپ تاپ ها به شمار می آید که دارای انواع مختلفی است. بهره جستن از این قطعه در لپ تاپ و کامپیوترهای شخصی به این منظور است که با استفاده از این کارت می توان مجموعه ای از کدها و عددها را روی نمایشگر خود مشاهده کنید که با مراجعه نمودن به دفترچه راهنما عیب مادربرد می توان عیب نهفته در مادربرد را تشخیص داد.

نکته ای که در این خصوص است؛ این امر می باشد که به واقع هر چقدر تعداد نمایشگر بیشتر باشد، ERROR  های آن به صورت تخصصی تری می باشد. بنابراین می توان گفت اصولا دیباگر با همه مادربردهای لپ تاپ سازگاری دارد.


مادربردهایی که پورت های  MiniPCI , MiniPCI-E , LPCرا ساپورت می کند. با خرید یک دیباگر می توانید از دفترچه راهنمای آن نیز بهره ببرید که همراه آن است. در این دفترچه کدها و معنا و مفهوم آن ها به طور کامل توضیح داده شده است تا کدی که توسط دیباگر نمایش داده می شود را در دفترچه راهنما پیدا کرد و معنا و مفهوم آن را نیز دریافت.

بنابراین کارت دیباگر به طور کلی برای تشخیص خرابی و عیب یابی در مادربرد سیستم های شخصی است که بوسیله ی post code  های منتشر گشته از بایوس برای هر قسمت مادربرد دستگاه قسمت آسیب دیده در آن را تشخیص داد و پس از عیب یابی به کمک تعمیرکاران حرفه ای این قسمت حساس در لپ تاپ ها را تعمیر ساخت.

چراغ  RESET : این چراغ همیشه باید خاموش باشد تنها به هنگام روشن و خاموش و ریست کردن یک لحظه روشن می گردد. چرا که در غیر این صورت اگر کلا روشن باشد یا چشمک برند، تصویر سیستم شما به هیچ عنوان بالا نمی آید

چراغ CLK(CLOCK : این چراغ باید همیشه روشن باشد.

چراغ SYSCLOCK: باید روشن باشد و در بسیاری از موارد چشمک بزند تا سالم باشد.

FRAME: این چراغ به هنگام روشن شدن مادربرد باید روشن شود.

IRDY: این چراغ نیز به هنگام روشن شدن سیستم باید روشن باشد.

چراغ های تغذیه (12+و..): این چراغ ها اگر خاموش باشند، ممکن است خرابی از اسلات یا خود دیباگر باشد.


برخی از ارورها و کدهای مخصوص دیباگر
فهرست کردن تمامی ارورها و کدها در این مختصر نمی گنجد. چرا که این کدها بسیار زیاد هستند و نمی توان تک تک آنان را در اینجا ذکر کرد. ولی برای آشنایی با کدهای مخصوص دیباگر در این قسمت به برخی از آنان اشاره می شود:

کد no و ff و 00 و C0 و CF دیباگر
این کدها برای عدم شناسایی سی پی یو می باشد. در مواقعی که سی پی یو دستگاه شناسایی نمی شود، یا مشکل ناشی از سوختن سی پی یو است یا جدا شدن اسلات از برد یا سوختن و لحیم سردی چیپ ها و… که در هر صورت بهترین کار تعویض سی پی یو می باشد. اولین و مهمترین کار عیب یابی است بعد از تشخیص عیب تعمیر یا تعویض هر قطعه ای توسط تعمیرکار کار سختی نیست.

کد af و A0 و DD و D1 و D9 و D5 و D3 و C1 و C3 و b0 دیباگر
این کدها نیز از جمله ارورهایی محسوب می شوند که بر روی دیباگر نمایش داده می شود. به عنوان مثال کد A0 می تواند ناشی از پدید آمدن یک مشکل در دستگاه های متصل به پورت ساتا باشد. البته گاهی اوقات این مشکل به رم مربوط می شود. اکثر این کدها ناشی از خرابی رم و کارت گرافیک و قطعات مربوط به آن است که یک تعمیرکار با دیدن این کد روی دیباگر دقیقا به سراغ رم و کارت گرافیک می رود تا در صورت خرابی این ناحیه بتواند آن را تعمیر یا تعویض نماید.

کد C1 دیباگر
چک شدن حافظه جانبی CPU و  RAM که باید این دو قسمت را چک نمود و خرابی ناشی از آن را تعمیر نمود.

کد 50 دیباگر
شناسایی USB

کد 52 دیباگر
شمردن میزان حافظه رم و مشکلات ناشی از آن

کد F1 دیباگر
رفتن مادربرد به حالت استندبای

کد F5 دیباگر
قرار گرفتن مادربرد دستگاه در آستانه خاموش شدن

کد 85دیباگر
رمز عبور / چک خطا نرم 

کد 98 دیباگر
پردازش پس از کنترل ROM اختیاری

کد 00 دیباگر
کنترل INT 19 بوت لودر 

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
