import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class hard_check_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<hard_check_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/JqOBH0KevC8';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('هارد دیسک و تست نرم افزاری'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''انواع هارد :
انواع هارد : هارد دیسک کامپیوتر دستگاهی است که کلیه نرم افزارهای نصب شده روی کامپیوتر و هم چنین کلیه پرونده های داده ایجاد شده و استفاده شده توسط این نرم افزار را در خود ذخیره می کند.

این شامل هر داده ای که ایجاد کرده و بارگیری کرده اید ، مانند عکس و موسیقی می شود . هارد دیسک به جای حافظه موقت مانند حافظه دسترسی تصادفی (RAM) ، نوعی ذخیره سازی دائمی است.

این به آن معنا است که وقتی کامپیوتر را خاموش می کنید ، پرونده ها با خیال راحت روی درایو ذخیره می شوند تا دفعه دیگر که کامپیوتر خود را راه اندازی می کنید ، بتوانید دوباره از آن ها استفاده کنید.

در حالت کلی دو نوع هارد وجود دارد: HDD (درایو دیسک سخت) و SSD (درایو شرایط جامد).که در ادامه انواع هارد hdd و انواع هارد ssd را به طور کامل شرح می دهیم.
انواع ظرفیت هارد
کارشناسان معتقدند 16 ترابایت فضای ذخیره سازی حداکثر ظرفیت مورد نیاز برای تأمین نیاز حتی بیشترین تقاضای کاربران رایانه در آینده خواهد بود. البته ، زمانی وجود داشت که تمام نیاز شما 16 گیگابایت بود.

با ظهور سیستم‌های ذخیره سازی ابری ، درایوهای فلش قابل حمل و سرویس‌های جریانی ، تقاضا برای هارد دیسک‌های شخصی رو به کاهش است. همچنین ، درایوهای ذخیره سازی بزرگ به معنای از دست رفتن زیاد داده‌ها در صورت خرابی است که باعث می‌شود ذخیره سازی ابری گزینه بسیار ایمن‌تری باشد.

بیشتر کاربران غیرحرفه‌ای با 250 تا 320 گیگابایت فضای ذخیره سازی مشکلی نخواهند داشت. به عنوان مثال ، 250 گیگابایت می‌تواند بیش از 30000 عکس یا آهنگ با اندازه متوسط را در خود جای دهد. اگر قصد ذخیره فیلم‌ها را دارید ، قطعاً به 500 گیگابایت یا شاید حتی 1 ترابایت نیاز دارید.
HDD :
در اکثر کامپیوتر های شخصی و لپ تاپ ها نصب شده است. داخل درایو چندین صفحه آلومینیومی وجود دارد. عملیات خواندن و نوشتن به دلیل چرخش صفحات و سر حسگر واقع در چند نانومتر انجام می شود.

سرعت صفحات می تواند تا 15000 دور در دقیقه باشد که منجر به صدای نویز هنگام کار می شود. این هارد درایوها به این علت  محبوب شده اند که در هنگام خواندن و نوشتن فضای زیادی را ایجاد می کنند (حداکثر 4 ترابایت روی یک HDD) و قابلیت اطمینان و پایداری بالایی دارند.

کامپیوترها برای ذخیره دائمی داده ها به درایوهای دیسک سخت (HDD) متکی هستند. آن ها دستگاه های ذخیره سازی هستند که برای ذخیره و بازیابی اطلاعات دیجیتالی مورد نیاز برای رجوع به آن ها  در آینده استفاده می شوند.

هارددیسک ها فرار نیستند ، به این معنی که حتی در صورت نداشتن قدرت ، داده ها را حفظ می کنند. اطلاعات ذخیره شده ایمن و دست نخورده باقی می ماند مگر اینکه هارد دیسک از بین برود یا تداخلی در آن ایجاد شود.

اطلاعات بر خلاف دسترسی پی در پی ، به روش دستیابی تصادفی ذخیره یا بازیابی می شود. این بدان معنا است که می توان در هر زمان که مورد نیاز باشد بدون عبور از بلوک داده های دیگر به بلوک های داده ، دسترسی داشت .
انواع هارد hdd
هنگامی که در مورد ذخیره سازی کامپیوتر صحبت می‌شود ، منظور همان درایوهای سخت یا هارد دیسک‌ها است.در این دستگاه‌ها تمام داده‌های رایانه شما وجود دارد ، از پرونده‌های سیستم عامل حاکم بر دستگاه شما گرفته تا سند مهم کاری تا بازی که از آن استفاده می‌کنید. همه این موارد در هارد دیسک شما ذخیره شده است ، بنابراین شما باید مطمئن شوید که نوع مناسب هارددیسک برای کاری که می‌خواهید انجام دهید ، چیست. سه نوع مختلف دیسک سخت وجود دارد: SATA ، SSD و NVMe . در این مقاله ، با هر نوع و نقاط قوت و ضعف و انواع ظرفیت هاردها آشنا خواهید شد. چه بخواهید یک رایانه شخصی جدید بخرید و چه بخواهید رایانه فعلی خود را به روز کنید.

SATA drives
SATA  یا Serial Advanced Technology Attachment که در سال 2003 معرفی شد ، رابط کاربری پیش فرض اکثر درایوهای سخت افزاری دسک تاپ و لپ تاپ است. از آنها به عنوان هارد دیسک‌های SATA یاد می‌شود ، اما در واقع آنها هارددیسک‌های دوار با صفحه‌های چرخشی و یک سوزن متحرک هستند که داده‌ها را برای بخش‌های متوالی در هر صفحه  آماده می‌کنند. هارد دیسک‌های SATA در مقایسه با نسل قبلی خود ، هارد دیسک PATA فوق العاده سریع هستند و می‌توانند با سرعت رابط 6 گیگابایت بر ثانیه و توان تولید 600 مگابایت بر ثانیه روی دیسک بنویسند.

یک هارد درایو می‌تواند از 500 گیگابایت تا 16 ترابایت باشد . اگر به فضای ذخیره سازی زیادی نیاز داشته باشید و نیازی به خواندن یا نوشتن نداشته باشید ، درایوهای خوبی هستند. از آنجا که داده‌ها به صورت فیزیکی روی دیسک نوشته می‌شوند ، می‌توانند تکه تکه شوند ، به این معنی که بخشهای مختلف می‌توانند در مناطق مختلف دیسک پخش شوند و باعث کم شدن سرعت درایو شوند. همچنین از آنجا که در هر درایو قطعات متحرک وجود دارد ، در برابر ضربه و حرکت ناگهانی آسیب پذیر هستند ، و همین امر آنها را به گزینه ضعیفی برای لپ تاپ تبدیل می‌کند.

SSD hard drives
SSD مخفف Solid State Drive است. این دیسک‌ها هیچ قسمت متحرکی ندارند. در عوض ، تمام داده‌ها در حافظه فلش غیر فرار ذخیره می‌شوند. این بدان معنی است که سوزنی وجود ندارد که برای خواندن یا نوشتن داده حرکت کند و سرعت آنها به مراتب بیشتر از درایوهای SATA است. یافتن سرعت دقیق دشوار است زیرا از نظر سازنده و فاکتور متفاوت است ، اما حتی درایوهای با عملکرد پایین نیز قابل مقایسه با درایوهای SATA هستند .

نکته منفی این است که این درایوها به طور قابل توجهی گران‌ترند و اندازه آنها زیاد نیست. درایوهای SSD در حدود 120 گیگابایت تا 2 ترابایت هستند و تقریباً 2 تا 4 برابر قیمت هارد دیسک SATA در همان اندازه هستند. از آنجا که هیچ قسمت متحرکی وجود ندارد ، این درایوها همچنین از دوام بسیار بالاتری برخوردار هستند و فاکتورهای خاصی برای لپ تاپ‌ها ساخته شده است که آنها را برای ذخیره سازی در حال حرکت ایده آل می‌کند.

NVMe
Nonfolatile Memory Express یا NVMe در سال 2013 منتشر شد ، نوعی SSD است که به یک اسلات PCI Express (PCIe) در برد اصلی متصل است. این اسلات‌ها در اصل برای کارت‌های گرافیک طراحی شده‌اند ، به همین دلیل فوق العاده سریع هستند. سرعت درایوهای NVMe می‌تواند به سرعت رابط 32 گیگابایت در ثانیه با توان خروجی 3.9 گیگابایت در ثانیه برسد.

اگر کاری انجام دهید که به توان زیاد دیسک نیاز دارد ، مانند بازی یا ویرایش فیلم با وضوح بالا ، این می‌تواند بسیار مفید باشد. با هر سرعتی ، اشکالاتی در NVMes وجود دارد. برای مبتدیان ، آنها فقط در رایانه‌های رومیزی موجود هستند و بسیار گران هستند. همچنین ، اگرچه می‌توانند به عنوان درایوهای ثانویه مورد استفاده قرار گیرند ، اما برای استفاده کامل از آن ، باید سیستم عامل خود را بر روی آن نصب کنید.

SSD :
 

SSD ها از تراشه های حافظه استفاده می کنند و از آن جا که هیچ عنصر چرخشی ندارند ، کاملاً بی صدا هستند ، مصرف برق کمتری دارند و از HDD ها نیز کوچک تر هستند.

عملیات خواندن و نوشتن در SSD سریع تر انجام می شود (پرونده ها سریعتر باز ، ذخیره و حذف می شوند). با این حال ، هر چرخه بازنویسی ، درایو را می سوزاند که باعث کاهش عمر مفید آن می شود.

SSD ها برای انجام پروژه های پر بار با خواندن و نوشتن بی شمار مناسب هستند. هارد های SSD سرعت وب سایتی را که با هر سیستم مدیریت محتوا مدرن ایجاد می شود ، افزایش می دهند.

تقسیم بندی انواع hard disk امروزه تغییر کرده و انواع مختلفی دارند که در حال حاضر 4 نوع هارد وجود دارد.

(Parallel Advanced Technology Attachment :PATA)
(Serial ATA: SATA)
(Small Computer System Interface: SCSI)
(Solid State Drives :SSD)

انواع هارد ssd
SATA SSD
SSD های SATA اولین نسل SSD ها هستند. سرعت خواندن آنها تا 570 مگابایت در ثانیه است. این SSD های نسل اول به طور کلی 5 برابر سریعتر از HDD سنتی هستند. متداول‌ترین نوع SATA در لپ تاپ‌ها ، یک SSD 2.5 اینچی است. این SSD ها لپ تاپ شما را در مدت زمان 15 ثانیه روشن می‌کنند و بازی‌های بزرگ را ظرف چند لحظه بارگیری می‌کنند.

NVMe SSD
NVMe یک پروتکل است که به شما امکان می‌دهد سرعت بیشتری حتی نسبت به SATA SSD داشته باشید. این بدان معنی است که یک NVMe SSD می‌تواند به سرعت خواندن 2600 مگابایت در ثانیه برسد. این سرعت تقریباً 5 برابر سریعتر از درایو SATA است.

کانکتور 2
رابط M.2 اطمینان حاصل می‌کند که یک SSD می‌تواند به سرعت خواندن و نوشتن بالاتری برسد. این به این معنی است که یک NVMe SSD می‌تواند بهینه استفاده شود و سرعت آن بیش از 2600 مگابایت در ثانیه باشد. هنگامی که مادربرد کانکتور M.2 ندارد ، NVMe SSD از طریق کارت PCIe که دارای کانکتور M.2 است ، متصل می‌شود. به همین دلیل است که برخی از لپ تاپ‌ها دارای PCIe NVMe M.2 SSD هستند. اگر مادربرد دارای M.2 مستقیم باشد ، SATA M.2 یا NVMe M.2 را مشاهده خواهید کرد.

اتصال PCIe
کارت‌های ویدئویی مادربرد را می‌توان با اتصال PCIe نیز متصل کرد. هنگامی که NVMe SSD به این وصل است ، به حداکثر پهنای باند مجهز است و می‌تواند حداکثر سرعت را از NVMe SSD دریافت کند. تنها هنگامی که با پرونده‌های بزرگ 50 گیگابایتی یا بالاتر کار می‌کنید متوجه تفاوت سرعت می‌شوید. شروع ویندوز و بازی‌ها به همان سرعتی که با SSD سنتی دارید سریع است.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
