import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class keyboard_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<keyboard_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/xmgrk6Rz6kY';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('رفع مشکلات کیبورد لپتاپ'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''کیبورد لپ تاپ کار نمی کند
گاهی اوقات نوت بوک کار می کند ، ناگهان کل صفحه کلید از کنترل خارج می شود و هیچ کلیدی پاسخ نمی دهد. این شایع ترین وضعیت است. لطفا با توجه به مراحل ما مشکل خود را حل کنید.
لپ تاپ را restart (دوباره راه اندازی) کنید
معمولاً بسیاری از مشکلات فنی به دلیل فرسودگی منابع سیستم ایجاد می شود. در این زمان ، فقط باید لپ تاپ خود را دوباره راه اندازی کنید تا مشکل صفحه کلید لپ تاپ بر طرف شود. این روش معمولاً برای اکثر مسائل رایانه ای مناسب است. اولین قدم که باید انجام دهیم این است که لپ تاپ را دوباره راه اندازی کنیم. پس از راه اندازی مجدد لپ تاپ ، اگر صفحه کلید هنوز کار نمی کند ، لطفاً مراحل زیر را دنبال کنید.
وارد safe mood “حالت ایمن” شوید
سیستم را دوباره راه اندازی کنید ، اگر می توانید وارد حالت safe mode شوید ، شروع به ضربه زدن روی کلیدf8  می کنید و صفحه کلید در حالت safe mode به خوبی کار می کند ، به این معنی که صفحه کلید خوب است و مسئله مربوط به نرم افزار است

نصب مجدد درایور صفحه کلید
در مرحله دوم ، ما مشخص کردیم که صفحه کلید در حالت ایمن خوب کار می کند. اکنون باید بررسی کنید که آیا درایور صفحه کلید مشکلی دارد یا خیر ، باید این کار را در Device Manager انجام دهید.

– لطفاً روی دکمه start (شروع )در لپ تاپ خود کلیک کنید ، و  Control Panelرا در لیست مشاهده کنید.

-برای مشاهده همه موارد کنترل پنل بر روی نمایش توسط نمادهای کوچک یا مشاهده بر روی نمادهای بزرگ کلیک کنید

– روی Device Manager  کلیک کنید تا باز شود

-برای باز شدن صفحه کلید ، دوبار کلیک کنید و روی صفحه کلید خود راست کلیک کنید ، سپس Uninstall device را انتخاب کنید.

– پس از حذف درایور ، لپ تاپ خود را مجدداً راه اندازی کنید و ویندوز به طور خودکار درایور دستگاه را دوباره نصب می کند. سپس بررسی کنید که آیا صفحه کلید شما اکنون کار می کند یا خیر

کابل صفحه کلید با اتصال بد
اگر درایور دوباره نصب شده و صفحه کلید هنوز کار نمی کند ، برای بررسی اتصال کابل صفحه کلید باید لپ تاپ را باز کنیم. باید کابل صفحه کلید را جدا کرده و دوباره به مادربرد متصل کنید.


صفحه کلید معیوب
اکنون وقت آن است که صفحه کلید خود را تعویض کنید ، لطفاً یک صفحه کلید جدید از فروشگاه قطعات ما خریداری کنید و جایگزین صفحه کلید آسیب دیده قبلی کنید.

برخی از کلیدهای لپ تاپ کار نمی کنند
 

بعضی اوقات بعضی از کلیدها ناگهان کار نمی کنند یا نمی توان آنها را فشار داد. این شرایط معمولاً توسط خود کیبوردها ایجاد می شود. لطفاً با توجه به سه مرحله زیر مشکلات را برطرف کنید.

-صفحه کلید تمیز
شاید خرده ریزهایی در زیر صفحه کلید پنهان شده باشد. صفحه را بچرخانید ، برای تمیز کردن صفحه کلید از قلم مو یا دمیدن هوا استفاده کنید.

-کلید آسیب دیده است
اگر برخی از کلیدها فشرده شوند اما نمی توانند دوباره تنظیم شوند ، به این معنی است که کلید آسیب دیده است. باید این کلید را تعویض کنید یا کل صفحه کلید را تعویض کنید.

-کابل صفحه کلید با اتصال بد
لطفاً لپ تاپ را باز کرده و کابل صفحه کلید را دوباره وصل کنید

برخی از کلیدهای کیبورد درست کار نمی کند
هنگام استفاده از لپ تاپ ، با مواردی روبرو می شویم که ورودی کلید نادرست است ، معمولاً به دلیل تنظیمات نادرست صفحه کلید.

-طرح صحیح صفحه کلید را انتخاب کنید
به Start> Control Panel> Regional & Languages ​​بروید ، روی برگه Languages ​​سپس تب Details کلیک کنید. با این کار گفتگویی باز می شود که می توانید طرح بندی صفحه کلید را انتخاب کنید.

 

-کلید NumLock را علامت بزنید.
در صورت فعال بودن NumLock ، بسیاری از لپ تاپ ها یک کاراکتر را به شماره تبدیل می کنند. برای اطمینان از غیرفعال بودن NumLock یا Fn + NumLock را فشار دهید.
برای خاموش کردن شماره قفل در Lenovo ، این Fn + F10 است ، اما ممکن است ترکیب کلید بر اساس سازنده متفاوت باشد. در بیشتر لپ تاپ ها ، کلید ترکیبی Fn + Insert است.''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
