import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class laptop_service_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<laptop_service_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/hmT6bk1lsck';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('مشکلات حرارتی و نحوه سرویس لپتاپ'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''لپ تاپ ها وسایلی بسیار پرکاربرد هستند و به همین سبب به طور مداوم مورد استفاده قرار می گیرند. استفاده فراوان لپ تاپ ها سبب شده است تا این وسایل در معرض آسیب ها و آلودگی های فراوانی باشند. از طرف دیگر لپ تاپ ها وسایلی با ساختار بسیار ظریف و حساس هستند و این امر نیز امکان وارد شدن آسیب به این تجهیزات را افزایش داده است.
                      
                      همانطور که اشاره شد استفاده از لپ تاپ ها به صورت مداوم و در همه شرایط سبب می شود تا وارد شدن آلودگی به این دستگاه ها اجتناب ناپذیر باشد. گرد و غبار موجود در هوا و یا سطوح محیط، در هر شرایطی به منافذ و شیار های لپ تاپ وارد می شوند و همواره مشاهده می شود که محل خروجی تهویه هوای لپ تاپ یا سوراخ های خروجی اسپیکر های لپ تاپ، گرد و غبار گرفته اند. همچنین یکی از روش های نادرست استفاده از لپ تاپ، استفاده به صورت مستقیم روی فرش است که سبب می شود پرز های فرش وارد منافذ لپ تاپ شما بشوند.
                      
                      همانطور که می دانید، پردازنده مهم ترین و گران قیمت ترین قطعه هر لپ تاپ است که معمولا حرارت زیادی در حین فعالیت ایجاد می کند. به همین سبب در کنار پردازشگر لپ تاپ همواره فن خنک کننده ای قرار داده می شود تا گرمای تولید شده توسط CPU را خارج کند. وجود گرد و غبار و آلودگی در محل خروجی هوای فن لپ تاپ، مانع از انجام درست تهویه هوای گرم درون لپ تاپ می شود. عدم خروج هوای گرم و تهویه مناسب، در دراز مدت به پردازنده (CPU) لپ تاپ شما آسیب وارد می کند.

همچنین وجود گرد و غبار در خروجی اسپیکر های لپ تاپ پس از مدتی استفاده از آن، سبب می شود تا صدای لپ تاپ به درستی خارج نشود و شاهد افت کیفیت و حجم صدای لپ تاپ باشیم.

یکی دیگر از قسمت های لپ تاپ که بسیار ممکن است تحت شرایط گوناگون آلودگی های زیادی را به خود بگیرد، کیبورد لپ تاپ است. معمولا در همه لپ تاپ ها به دلیل ارتباط مستقیم با دست ها و همچنین نزدیک تر بودن این بخش به میز کار شما، گرد و خاک و آلودگی های زیادی در زیر کلید های کیبورد لپ تاپ جمع می شود که در دراز مدت سبب عملکرد نادرست کلیدها می شوند.

برای رفع مشکلات ناشی از آلودگی لپ تاپ سرویس سالیانه لپ تاپ توصیه می شود. با سرویس سالیانه لپ تاپ که توسط واحد فنی آسارایان انجام می شود، خروجی های لپ تاپ شما از جمله خروجی هوای فن خنک کننده، خروجی های اسپیکر و کیبورد لپ تاپ شما به طور کامل تمیز می شود تا عمر دستگاه های شما افزایش یابد.

همانطور که می دانید، همواره پیشگیری بهتر از درمان است. سرویس سالانه لپ تاپ که در مرکز آسارایان انجام می شود، لپ تاپ شما را از هرگونه آلودگی و گرد و غبار پاک می کند. با سرویس سالانه لپ تاپ، عمر قطعات مهم لپ تاپ خود مانند CPU را تا چندین سال افزایش دهید. اگر به صورت منظم لپ تاپ خود را سرویس کنید، در صورت استفاده صحیح از لپ تاپ، عمر قطعات شما تا چند سال افزایش پیدا می کند و نیاز به صرف هزینه های گوناگون برای تعویض قطعات و همچنین خرید لپ تاپ جدید از بین می رود. برای مثال باید گفت که هزینه خرید تنها یک CPU جدید برای لپ تاپ، از هزینه چند سال سرویس مداوم لپ تاپ کمتر است. پس بهتر است به جای رها کردن لپ تاپ به حال خود، آن را هر چند وقت یکبار سرویس کرد تا با هزینه بسیار کمتر، عمر قطعات داخلی لپ تاپ از جمله CPU را افزایش داد.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
