import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class laptop_lcd_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<laptop_lcd_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/uHvNyx7eEjo';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('خرابی های lcd , led'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''خرابی ال سی دی لپ تاپ:
خرابی LCD لپ تاپ
ال سی دی لپ تاپ برای روشن شدن به برد کوچکی به نام هایولتاژ نیازمند است که در صورت اینکه این برد خراب شود تصویر به شما نمایش داده نمی شود بنابراین شما می توانید با مراقبت بیشتر از سیستم خود از این برد محافظت کنید. از دیگر دلایل خرابی LCD لپ تاپ شما می تواند ریختن مایعات بر روی آن باشد که در صورت بروز این اتفاق سریعا آب یا سایر مایعات در سیستم شما نفوذ می کند و به برد اصلی لپ تاپ آسیب وارد می شود.
شایع‌ ترین علائم خرابی ال سی دی لپ تاپ عبارت اند از:
شکستگی و ترک خوردگی در قسمت های مختلف LCD
تغییر رنگ در یک قسمت ال سی دی
ایجاد یک نقطه سیاه رنگ بزرگ در یک بخش از LED یا LCD
ایجاد خطوط افقی یا عمودی به رنگ سیاه در قسمت های مختلف تصویر
سوختگی پیکسل
شکستگی کامل و نداشتن نور
از دیگر دلایل خرابی ال سی دی لپ تاپ می تواند این موارد باشد: حساسیت به گرد و غبار و ضربه و اصابت اشیای نوک تیز و … .




خرابی فلت لپ تاپ:

یکی از قطعاتی که در لپ تاپ ها به کار رفته است فلت است. فلت در واقع نوعی کابل است که بسته به نوع صفحه نمایش از دو نوع فلت ال سی دی و فلت ال ای دی تشکیل شده است. فلت LCD فلتی است که برای لپ تاپ هایی با صفحه نمایش LCD استفاده می‌ شود و پین‌ های بزرگتری نسبت به فلت های LED دارد. فلت LED فلتی است که در لپ تاپ ‌هایی با صفحه نمایش LED استفاده می‌ شود.

شایع‌ ترین علائم خرابی فلت عبارت اند از:
لپ تاپ شما روشن می‌ شود اما صفحه نمایش مشکی است. که شما با تکان دادن فلت می توانید آن را روشن کنید.
صفحه نمایش لپ تاپ شما روشن می شود اما بسیار تاریک است و هم چنین کمی تغییر رنگ و تصاویر کم نور نیز در مانیتور مشاهده می کنید.
صفحه نمایش روشن می شود بعد از چند بار چشمک زدن تیره می شود.
صفحه نمایش شما به رنگ سفید یا سیاه است و مانیتور خارجی کار می‌ کند.
خطوط افقی و عمودی راه راه بر روی صفحه نمایش دستگاه ظاهر می شود.

خرابی مادربورد
خرابی LCD لپ تاپ 
خرابی مادربرد در واقع قاتل اصلی سیستم شماست. مادربرد یکی از قطعات اصلی و حساس لپ تاپ شماست که در صورت خرابی و با بروز این مشکل سیستم شما خراب می شود. با خرابی شدن مادربرد عملکرد دستگاه از کار می افتد، زیرا پردازشگر به تنهایی با هیچ یک از قطعات ارتباط مستقیم ندارد و فقط یک پردازنده است. این مورد باعث از کار افتادن ال سی دی لپ تاپ شما نیز خواهد شد.

شایع‌ ترین علائم خرابی مادربرد عبارت اند از:
روشن نشدن دستگاه
خاموش شدن کامل دستگاه
بعد از روشن شدن سیستم تصویری که بر روی نمایشگر ظاهر می شود ناقص و درهم است.
پرش تصویر
به هم ریختگی رنگ تصویر



خرابی چیپ کارت گرافیک

واحد پردازش کارت گرافیک، چیپ گرافیک است. وظیفه این واحد تبدیل اطلاعات صفر و یکی به تصویر است. کارت گرافیک نیز یکی از همانند سایر کارت هایی تبدیل داده باینری را انجام می دهد که برای قابل درک و فهم بودن این اطلاعات برای کاربران، نیاز است که از یک اینترفیس و یا کارت استفاده گردد.




شایع‌ ترین علائم خرابی چیپ کارت گرافیک عبارت اند از:
تعدادی از علائم خرابی چیپ کارت گرافیک نیز هم مانند مادر برد است که ما در این قسمت مجددا برای شما نام می بریم.

نمایشگر روشن است اما تصویری تولید نمی شود.
نمایشگر روشن می شود اما تصاویر به هم ریخته هستند.
نمایشگر روشن می شود اما تصاویر سیاه رنگ هستند.
پرش تصویر
تصاویر به صورت عادی و درست نمایش داده شده ولی پس از مدتی تصویر خراب می گردد.
نمایشگر روشن می شود اما تصاویر آبی رنگ می باشد.


''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
