import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class laptop_test_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<laptop_test_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/CsYpOQ3EFto';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('تست تشخیص لپتاپ های مختلف'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''برای تست کامل لپ تاپ قبل از هر امری بهتر است کارتن لپ تاپ مورد نظر را بررسی کنید تا مشخصات لپ تاپ با آنچه بر روی جعبه است یکی باشد. برای تست کامل لپ تاپ توجه داشته باشد لپ تاپی که خریداری می کنید بدون ویندوز و برنامه نباشد و در هنگام خرید نصب ویندوز را در اولویت قرار دهید. پس از نصب بر روی My Computer کلیک راست کرده و گزینه Properties را انتخاب کنید در پنجره باز شده اطلاعات رم و سی پی یو را با مشخصات لپ تاپ خریداری شده مقایسه کنید. در ادامه از سمت چپ پنجره باز شده گزینه Device Manager را انتخاب کنید تا اطلاعات مربوط به نصب درایورهای لپ تاپ را مشاهده کنید و از نصب درایورها مطمئن شوید. سپس در ادامه تست کامل لپ تاپ با استفاده از کلید ترکیبی Win + R باکس Run را باز کرده و عبارت Dxdiag را نوشته و اینتر را بفشارید و در پنجره باز شده به قسمت Display رفته و اطلاعات نصب گرافیک لپ تاپ مورد نظر را چک کنید.
                      برای تست کامل لپ تاپ از نظر گرافیک می توانید از قسمت Nvidia Control Panel مشخصات گرافیک اصلی لپ تاپ چک کنید. سپس به پیکسل دستگاه دقت داشته باشد در صورت وجود نقطه ریز به رنگ سفید یا سیاه دستگاه حاوی پیکسل سوخته می باشد. در آخر به چک کردن تاچ پد دستگاه دکمه های کیبورد دستگاه بپردازید با کم و زیاد کردن نور سطوح مختلف روشنایی لپ تاپ را چک کنید همچنین با پخش یک فایل صوتی بلندگوها را چک کنید. باتری و شارژر لپ تاپ و پورت ها را بررسی کنید تا شکسته و معیوب نباشند و به این صورت یک تست کامل لپ تاپ را انجام داده اید.
                      یکی از بهترین نرم افزارها برای تست کامل لپ تاپ از نظر سخت افزاری عیب زدایی و انجام آزمایش بر روی سیستم ها برای جلوگیری از بین رفتن سخت افزار دستگاه در روزهای اولیه نرم افزار Bumln test Professional می باشد که با ساختن محیطی مجازی تمامی اجزاها و قطعات دستگاه مورد نظر را تحت فشار قرار داده و یک تست کامل لپ تاپ را اجرا می کند و در مورد پایداری و سلامت قطعات را مورد آزمایش قرار می دهد تا از کارکرد سالم قطعات اطمینان حاصل کند. این نرم افزار سرعت cpu را با انجام عملیات ریاضی و محاسبات SIMD محاسبه و هارد دیسک و دیگر قطعات از جمله سی دی رام، رم، رایتر و کارت صوت و گرافیک دستگاه را چک می کند که تمامی این عملیات با چند کلیک توسط این نرم افزار قابلیت اجرا را دارند تا تست کامل لپ تاپ صورت گیرد.
                      تست هارد لپ تاپ
برای تست هارد دیسک به صورت یک تست کامل لپ تاپ می توانید از برنامه کمکی Chkdsk.exe که در ویندوز موجود است و به کنترل هارد و مشخص کردن سکتورهای خرابی آن می پردازد استفاده کنید برای تست کامل لپ تاپ در مورد هارد دیسک یا باید از طریق خط فرمان Command Line اقدام کنید یا اینکه در مای کامپیوتر روی درایوی که قصد آزمایش آن را دارید کلیک راست کرده و گزینه Properties را انتخاب کنید در ادامه به تب tools رفته و در باکس Error checking روی دکمه check now کلیک کنید و برای تست کامل درایو مورد نظر Scan for and attempt recovery of bad sectors را انتخاب کنید. در صورت تست کامل لپ تاپ می توانید از عواقب بعدی همچون شنیدن صداهای عجیب غریب از سیستم خود که امکان آسیب به هارد دیسک را دارد جلوگیری کنید.

برنامه disc checkup یک برنامه برای تست کامل لپ تاپ در زمینه هارد می باشد که در پس زمینه ویندوز کار کرده و اطلاعات هارد را مورد بررسی قرار می دهد و در صورت بروز هر گونه مشکلی هشدارهایی مربوط به احتمال خرابی هارد را بیان می کند. یک برنامه کلی که به تست کامل لپ تاپ و قطعه هارد دیسک می پردازد برنامه شرکت سیگیت با نام Sea Tools می باشد که قادر به تست تمامی هارد ها در برند های مختلف می باشد.

علائم خرابی cpu لپ تاپ
برای تست کامل لپ تاپ توجه داشته باشید CPU خود گرما تولید می کند در صورت تولید نکردن گرما می توان پی برد که سی پی یو دچار مشکل است. همچنین در صورت خرابی سی پی یو دستگاه هیچ عکس العملی نشان نمی دهد به گونه ای که با زدن دکمه پاور دستگاه روشن نمی شود که از علائم خرابی سی پی یو می باشد.

مشکلات سخت افزار لپ تاپ
همانطور که اشاره شد با استفاده از نرم افزارهایی می توان با تست کامل لپ تاپ به مشکلات سخت افزاری دستگاه پی برد و آنها را برطرف کرد.

از کجا بفهمیم فن لپ تاپ سوخته است یا نه ؟
با توجه به اینکه در صورت کارکرد درست فن لپ تاپ صدای فن به گوش می رسد در تست کامل لپ تاپ باید به این موضوع توجه داشت که در صورت سوختن صدایی به گوش نمی رسد و سیستم مورد نظر داغ می کند و در پی آن مشکلاتی مانند قفل کردن سیستم و ظاهر شدن مداوم صفحه نمایش آبی و از بین رفتن داده های ذخیره شده بر روی هارد دیسک پیش می آید که نشانگر خرابی فن می باشد.

نرم افزار تست مادربرد
برای تست کامل لپ تاپ از لحاظ سخت افزاری، نرم افزار AIDA که به اسم AIDA64 Extreme Edition منتشر شده است یکی از بهترین و حرفه ای ترین نرم افزار ها برای تست و عیب یابی سخت افزار کامپیوتر می باشد. اگر احساس می کنید مشکلی در مادربرد سیستم شما پیش آمده است شما با استفاده از امکان تست جداگانه ی سخت افزار های سیستم این نرم افزار می توانید مادربرد سیستم را مورد تست و آزمایش قرار داده و از سالم و یا معیوب بودن آن مطلع شوید.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
