import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class lola_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<lola_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/ab9BdT6fYJ8';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('شکستگی لولا'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''من مشکل مربوط به لولا را در 4 نوع طبقه بندی کرده ام.

ناحیه محفظه پیچ ها شکسته است
پیچ های برنجی نگهدارنده پلاستیک خراب است
لولاها به چند قطعه تقسیم می شوند
وقتی نمایشگر سوسو می کند و یا درست کار نمی کند و اگر نمایشگر را حرکت دهید، آن برای 3-4 ثانیه کار می کند اما دوباره شروع به سوسو زدن می کند و / یا صفحه نمایش گاهی روشن و خاموش است.


لقی مانیتور لپ تاپ می تواند پایدار شود. روش های زیادی برای رفع مشکلات وجود دارد. برخی از آنها به مهارت و ابزار نیاز ندارند در حالی که برخی به تخصص و ماشین مته و پیچ و مهره ها احتیاج دارند. از آنجا که من تصور می کنم بیشتر افرادی که این پست را می خوانند، انتظار دارند که از روش های بدون ابزار بدانند، من آنها را در اولویت قرار می دهم. با این حال، من روش هایی را نیز ذکر می کنم که نیاز به کمی تجربه قبلی و مهارت دارند.

روش -1

کافی است یک شی سخت را در پشت لپ تاپ قرار دهید. اطمینان حاصل کنید که قسمت صفحه نمایش لپ تاپ بر روی جسم سخت قرار دارد تا هنگام استفاده از آن جابجا نشود. سال گذشته، وقتی ps4 را روی لپ تاپی بازی کردم که این مشکل را داشت، این کار را کردم.

روش -2

همچنین برخی از لنت های اصطکاک وجود دارد که می تواند در لولاها ثابت شود. این لنت های اصطکاکی لرزش و میزان باز شدن آزادانه قسمت صفحه را کاهش می دهد.

روش -3

شما می توانید لولای مورد نیاز خود را از شرکت تولید کننده سفارش دهید به خصوص اگر هنوز ضمانت دارید. با سازنده خود تماس بگیرید، مشکل را برای آنها توضیح دهید و آنها برخی مراحل عیب یابی را به شما می گویند. برای عیب یابی ساده که ممکن است مشکل را حل کند، بسیار مهم است که با سازندگان خود تماس بگیرید.

اکثر مردم تصور اشتباهی دارند که امکان تعمیر لولای شکسته وجود ندارد و تنها راه نجات این است که با شرکت تولیدکننده تماس بگیرید تا آن را برای شما برطرف کند.

اگر لپ تاپ شما بسیار قدیمی است و اگر امکان تعمیر لولا وجود ندارد، می توانید یک لپ تاپ جدید خریداری کنید.

روش – 4 (با استفاده از چسب)

چسب کاری قسمت لولا و بدنه شکسته و اصطلاحاً کامپوزیت کردن؛ نه تنها نیاز به ابزار و چسب مخصوص دارد بلکه مهارت و تخصصی نیز می خواهد. این کار چندان اصولی نیست و در صورت لزوم نیز می بایست خیلی دقیق و با ظرافت انجام شود.

نحوه جلوگیری از آسیب لولای لپ تاپ
لولای لپ تاپ یکی از قطعات لپ تاپ است که به راحتی خراب می شود. برای کاهش میزان آسیب، باید از باز و بسته شدن مداوم لپ تاپ خودداری کنید. با انجام این کار اغلب قلاب های صفحه شل و در نتیجه صفحه نمایش لق می شود.
از انداختن لپ تاپ خودداری کنید. این باعث آسیب به لولا می شود.
برای جلوگیری از اصطحکاک می توان لولا را روغن کاری کرد. هر نوع روغن و روان کننده ای توصیه نمی شوند، بنابراین شما باید با تولیدکننده دستگاه خود و یا تعمیرکار متخصص تماس بگیرید تا بهترین را شما پیشنهاد دهند.
در حالی که صفحه نمایش باز است از بلند کردن لپ تاپ باز خودداری کنید.
بیشتر لپ تاپ ها پیچ ندارند. برای سفت یا شل کردن لولای لپ تاپ، اطمینان حاصل کنید که از اندازه پیچ درست استفاده کرده اید. لولا به پلاستیک محکم شده است، بنابراین نباید فشار زیادی وارد شود تا از آسیب رساندن به پلاستیک ها جلوگیری شود.
قسمت صفحه لپ تاپ یک منطقه بسیار شکننده است. باید اطمینان حاصل کنید که لپ تاپ را با دقت باز می کنید.
سرعت و نیرویی که با آن لپ تاپ را باز می کنید بسیار مهم است. با لولا و نمایشگر با ملایمت رفتار کنید و لولا مطمئناً یک عمر طولانی را به شما می دهد.
لپ تاپ را با درب و صرفا گرفتن نمایشگر حمل و بلند نکنید.
لولای کاملاً جدید لپ تاپ من خراب است.

یک تجربه
به طور کلی، روش های زیادی برای تعمیر و تعویض لولای لپ تاپ شما وجود دارد و باید به دستورالعمل های سازنده کاملاً عمل کرد.
دریافت صدای لنگ همیشه شاخص خوبی برای شل شدن و پوشیدن لولا است.
شل شدن لولای لپ تاپ باعث می شود که لپ تاپ نسبتاً بی فایده باشد زیرا نمایشگر در موقعیتی که قرار می دهید باقی نمی ماند
این می تواند بسیار ناامید کننده باشد، به خصوص اگر پروژه ای برای انجام آن از طریق لپ تاپ دارید.
لقی لولای لپ تاپ می تواند نمایشگر لپ تاپ را خراب کند زیرا بیشتر سیم ها در معرض فرسودگی قرار می گیرند.
سرانجام، علاوه بر این، مشکلات دیگری نیز ممکن است از آنجا ناشی شود. موقعیت و طراحی هر لولا برای هر لپ تاپ متفاوت است.
لولا قسمت بسیار مهمی از لپ تاپ است. در صورت خراب شدن لولا لپ تاپ قابل استفاده نیست.''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
