import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class os_problem_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<os_problem_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/QboAYOkLBPY';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('مشکلات سیستم عامل'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''مشکل آپدیت به آخرین نسخه ویندوز ۱۰
یکی از نقاط قوت ویندوز ۱۰، آپدیت‌های پیوسته آن است. ویندوز ۱۰ در طول یک ماه، ممکن است چندبار آپدیت شود. مایکروسافت، از طریق این بروزرسانی‌ها، اشکالات و باگ‌های سیستم عامل را رفع می‌کند و تجربه بهتری به کاربر می‌دهد. اگر ویندوز شما فعال‌سازی شده باشد، بروزرسانی‌های ویندوز ۱۰ به‌صورت خودکار انجام می‌گیرد. اما گاهی هم نیاز است که به‌صورت دستی، آپدیت ویندوز را انجام دهید. با این حال، گاهی آپدیت به آخرین نسخه منتشر شده، با مشکل مواجه می‌شود.

مشکل کمبود فضای دیسک در ویندوز ۱۰
ممکن است بعد از ارتقا به ویندوز ۱۰، با کمبود فضای خالی در هارد درایو مواجه شوید. این مشکل، دلایل مختلفی دارد اما ویندوز ۱۰، با کمک ابزار Disk Cleanup به شما در رفع آن کمک می‌کند.

اگر به تازگی ویندوز خود را ارتقا داده‌اید، اطلاعات ویندوز قبلی شما، هنوز در درایو ویندوز نگه‌داری می‌شود. این یکی از قابلیت‌های ویندوز ۱۰ است، به‌طوری که تا ۳۰ روز بعد از ارتقا به ویندوز ۱۰، اطلاعات ویندوز قبلی در درایو ویندوز نگه‌داری می‌شود.
این کار بدین خاطر است که کاربر در این فرصت ۳۰ روزه، امکان بازگشت یا داون‌گرید به ویندوز قبلی خود را داشته باشد. البته در صورتی که از ویندوز ۱۰ راضی نباشد.

اگر شما از نصب تمیز استفاده کرده‌اید یا بیشتر از یک ماه است که از ویندوز ۱۰ استفاده می‌کنید؛ ممکن است فایل‌های قدیمی و سیستمی، فضای هارددرایو شما را اشغال کرده باشند. در هر صورت، می‌توانید با ابزار Disk Cleanup، فضای دیسک خود را خالی کنید.
منوی استارت را باز کنید و Disk Cleanup را تایپ کنید تا ویندوز این ابزار را برای شما پیدا کنید.
با اجرای Disk Cleanup، درایوهای مختلف کامپیوتر، به شما نشان داده می‌شود. درایو ویندوز خود را تیک بزنید.
دکمه Ok را انتخاب کنید. سپس ویندوز به جستجوی فایل‌های قدیمی درایو شما می‌پردازد و نتیجه را در یک پنجره جدید، نمایش می‌دهد.
اگر اطلاعاتی از ویندوز قدیمی، در درایو موجود باشد، فایلی تحت عنوان Previous Windows Installation(s) به شما نشان داده می‌شود که می‌توانید آن را پاک کنید.
در غیر این صورت، در پنجره قبلی، روی دکمه Clean up system files کلیک کنید. در پنجره جدیدی که باز می‌شود، لیستی از فایل‌های سیستمی به شما نشان داده می‌شود که می‌توانید برای آزادسازی فضای دیسک، آنها را پاک کنید.

خاموش کردن نوتیفیکیشن‌های غیرضروری
یکی از بخش‌های جدید ویندوز ۱۰، Action Center است که با کلیک روی سمت راست صفحه، باز می‌شود. در این بخش، همه نوتیفیکیشن‌های شما، یک‌جا نمایش داده می‌شوند. Action Center بدرد بخور است اما نوتیفیکیشن‌های بیش از حد، می‌تواند این بخش را شلوغ کند. بعضی از نوتیفیکیشن‌ها مهم و حیاتی‌اند، اما برخی را نیاز ندارید هر بار ببینید. اگر می‌خواهید در ویندوز ۱۰، این نوتیفیکیشن‌ها را فیلتر کنید، اقدامات زیر را انجام دهید.

بخش تنظیمات ویندوز را باز کنید.
به بخش System وارد شوید.
از پنل سمت چپ، روی Notification & actions کلیک کنید.
در صفحه‌ای که باز می‌شود، برنامه‌هایی که نوتیفیکیشن ارسال می‌کنند را می‌بینید.
می‌توانید هر کدام را که خواستید، غیرفعال کنید.

نرم‌افزارهای پیش‌فرض در ویندوز ۱۰
در ویندوز ۱۰، نرم‌افزارهای پیش‌فرض توسط سیستم عامل تعیین شده‌اند. این نرم‌افزارها، برنامه‌های ساخته مایکروسافت هستند. برای مثال، مرورگر پیش‌فرض در ویندوز ۱۰، Microsoft Edge است. اما کاربر می‌تواند هر زمان که خواست، برنامه‌های پیش‌فرض را تغییر دهد. با این حال، گاهی بعد از آپدیت ویندوز، نرم‌افزارهای پیش‌فرض، دوباره به تنظیمات قبلی برمی‌گردند. در ادامه به شما آموزش می‌دهیم که برنامه‌های پیش‌فرض را چگونه تعیین کنید.

به صفحه تنظیمات ویندوز بروید.
در قسمت Apps، روی Default apps کلیک کنید.
در اینجا می‌توانید برنامه‌های پیش‌فرض را ببینید.
هر کدام را بنا به انتخاب خود، تغییر دهید.
همچنین اگر از پایین صفحه، گزینه Choose default apps by file type را انتخاب کنید، می‌توانید برنامه‌های پیش‌فرض را برای انواع مختلف فایل (مثل فایل‌های متنی، فایل‌های صوتی، …) تعیین کنید.

کند شدن ویندوز ۱۰ بعد از آپدیت
یکی از مشکلات کاربران ویندوز ۱۰، کند شدن ویندوز بعد از مدتی بوده است. همچنین ممکن است، بعد از آپدیت ویندوز ۱۰، حس کنید که ویندوز همچون سابق سریع کار نمی‌کند. این می‌تواند به دلیل ناسازگار بودن آپدیت ویندوز با سیستم شما، یا عملکرد نرم‌افزارهای پس‌زمینه باشد. برای حل این مشکل می‌توانید اقدامات زیر را انجام دهید:

اگر با آخرین آپدیت ویندوز ۱۰ مشکل دارید، می‌توانید به یکی از آپدیت‌های قبلی آن، بازگردید.
برای این کار از قسمت تنظیمات به مسیر Update & security > View update history > Uninstall updates بروید.
در اینجا لیستی از آپدیت‌های نصب‌شده اخیر را مشاهده می‌کنید. آپدیت مورد نظر خود را انتخاب کرده و دکمه Uninstall را بزنید.
برای غیرفعال کردن نرم‌افزارهای پس‌زمینه، بعد از باز کردن صفحه تنظیمات، این مسیر را دنبال کنید: Privacy > Background apps
از این صفحه می‌توانید لیستی از برنامه‌های فعال در پس‌زمینه ویندوز را مشاهده کنید. شما می‌توانید هم به صورت مجزا این برنامه‌ها را غیرفعال کنید و هم به صورت یک‌جا.

مشکل طولانی شدن آپدیت ویندوز ۱۰
به‌طور میانگین، آپدیت ویندوز ۱۰ چیزی حدود ۲۰ تا ۳۰ دقیقه زمان می‌برد. اما این موضوع می‌تواند بسته به عوامل مختلفی، تغییر کند. اینکه آپدیت کلی است یا جزئی، سرعت اینترنت و قدرت پرداز‌شگر کامپیوتر، همه در این زمان، نقش دارند.

اما گاهی ممکن است آپدیت ویندوز ۱۰، بیش از حد طولانی شود، و در واقع آپدیت گیر کند. ویندوز برای کامل کردن فرایند آپدیت، بخشی از تغییرات را در زمان خاموش شدن ویندوز انجام می‌دهد. در این حالت، وضعیت پیشرفت آپدیت روی صفحه نمایان می‌شود.

چرا ویندوز آپدیت نمی‌شود
یکی از جدی‌ترین مشکلات کاربران ویندوز ۱۰، خطا در زمان آپدیت ویندوز است. خطاهای آپدیت، با کدهای مختلفی به کاربر نشان داده می‌شوند. هر کد نشان‌دهنده یک ایراد خاص است. اما لازم نیست شما معنای این کدها را بدانید تا بتوانید ایراد را برطرف کنید. خود ویندوز، این کار را برای شما انجام می‌دهد!

اگر با خطای آپدیت ویندوز ۱۰ مواجه شدید، عیب‌یاب داخلی ویندوز را اجرا کنید. ویندوز ۱۰، برای هر بخش از ویندوز، یک عیب‌یاب یا Troubleshooter دارد. با این نرم‌افزار، ویندوز به بررسی ایراد موجود می‌پردازد و ممکن است به صورت خودکار، مشکل را حل کند.
صفحه تنظیمات را باز کنید و به بخش Update & Security بروید.
از پنل سمت چپ، گزینه Troubleshoot را انتخاب کنید.
در صفحه بعدی، روی گزینه Additional troubleshooters کلیک کنید.
حالا روی گزینه Windows update کلیک کنید تا عیب‌یاب مخصوص آپدیت ویندز، اجرا شود.


مشکل تغییر ساعت و تاریخ در ویندوز
اگر تنظیمات ساعت و تاریخ ویندوز شما بهم ریخته است، می‌توانید از قسمت Settings آن را تنظیم کنید.

صفحه تنظیمات ویندوز را باز کنید و به قسمت Time & language بروید.
از پنل سمت چپ، گزینه Date & Time را انتخاب کنید.
اگر منطقه زمانی شما به درستی انتخاب نشده باشد، تاریخ و ساعت هم درست کار نخواهد کرد. از بخش Time Zone، منطقه زمانی خود یعنی تهران را انتخاب کنید.
اگر گزینه‌های Set time automatically و Set time zone automatically فعال نیست، آنها را فعال کنید.
در صورتی که این دو گزینه فعال نباشد، می‌توانید به صورت دستی تاریخ و زمان را وارد کنید. اما بهتر است این تنظیمات را روی حالت اتوماتیک قرار دهید و منطقه زمانی خود را به درستی انتخاب کنید.
در این صورت، ساعت و تاریخ سیستم شما، همیشه دقیق خواهد بود.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
