import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class touchpad_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<touchpad_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/hDASLGm0TZw';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('مشکلات تاچ پد odd'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''وقتی تاچ پد لپ تاپ کار نمی کند، با این که فریز شدن لپ تاپ و بررسی آن دور از ذهن است، اما ارزش بررسی مجدد را دارد. در صورتی که تاچ پد شما به صورت ناگهانی متوقف شود، احتمالا لپ تاپ فریز شده است. هنگامی که دستگاه فریز شود یا هنگ کند، تاچ پد و صفحه کلید عمل نخواهند کرد. برای آزمایش این مورد در ویندوز، باید کلید Windows را فشار دهید تا بدین ترتیب، منوی استارت (Start) بازگشایی شود، سپس کلیدهای ترکیبی Ctrl + Alt + Delete را به منظور بازگشایی صفحه امنیتی فشار دهید. در سیستم مک، باید کلیدهای cmd + Space را فشار دهید تا Spotlight بازگشایی شود که یک راه ساده به منظور فعال بودن رایانه شما با استفاده از صفحه کلید است.
                      یکی دیگر از دلایل کار نکردن تاچ پد را می‌توان غیرفعال کردن تصادفی آن با فشار دادن یک کلید ترکیبی دانست. بیشتر لپ تاپ‌ها دارای کلید Fn هستند که با کلیدهای F1 و F2 و سایر کلیدها ترکیب شده و می‌توانند عملیات خاصی را انجام دهند.

به عنوان مثال، امکان تغییر میزان روشنایی لپ تاپ با استفاده از کلیدهای ترکیبی ذکرشده وجود دارد. با‌این‌حال در بسیاری از لپ تاپ‌ها ممکن است یکی از کلیدهای ترکیبی موجب غیرفعال شدن تاچ پد شود. از آن جایی که ممکن است کلیدهای ذکرشده به سادگی انتخاب شوند، این احتمال وجود دارد که تاچ پد غیرفعال شود. قفل شدن تاچ پد لپ تاپ به علت غیر فعال بودن آن هم پیش می‌آید.

یکی دیگر از روش‌های رفع خرابی تاچ پد را می‌توان جداسازی ماوس‌های شخص ثالث دانست. همچنین اگر از ماوس‌های بلوتوثی استفاده می‌کنید هم باید اتصال آن‌ها را قطع کنید. بهتر است بدانید برخی از لپ‌تاپ‌ها به علت متصل شدن ماوس‌های جانبی دچار قطعی تاچ پد می‌شوند و جداسازی آن‌ها می‌تواند باعث رفع خطای احتمالی شود. در صورتی که ماوس سیمی یا بلوتوثی را جدا کنید و پس از راه‌اندازی مجدد دستگاه شاهد عمل کردن تاچ پد باشید، مشکل را پیدا کرده‌اید.

در مرحله بعد باید تنظیمات ماوس را در داخل ویندوز بررسی کنید تا خطاهای احتمالی را مورد بررسی قرار دهید. ابتدا وارد تنظیمات شوید و از بخش دستگاه‌ها (Devices)، گزینه تاچ پد (Touchpad) را انتخاب کنید. در این بخش باید مطمئن شوید که اسلایدر تاچ پد را فعال‌سازی کرده‌اید. همانطور که در قسمت بالا ذکر شد، باید کلیه تنظیمات را مورد بررسی قرار دهید تا بتوانید نسبت به فعال بودن تاچ پد اطمینان حاصل کنید.

در صورتی که نتوانید مشکل خود را از این منو حل کنید، ممکن است بتوانید وارد تنظیمات مخصوص صفحه لمسی در بخش دیگر شوید. شما باید وارد تنظیمات شوید و از بخش دستگاه‌ها (Devices) گزینه ماوس (Mouse) را انتخاب کنید تا بدین ترتیب، امکان ورود به گزینه‌های اضافی ماوس در سمت راست فراهم شود. در باکس جدید باید یک برگه جدید را در سمت راست مشاهده کنید که مربوط به تاچ پد است. در این بخش می‌توانید فعال یا غیرفعال بودن تاچ پد را مشاهده کنید. در صورتی که این بخش در گذشته کار نمی‌کرد، احتمالا گزینه‌های پیرامون غیرفعال بودن آن‌ها را مشاهده خواهید کرد و هم اکنون باید قابلیت ذکرشده را مجددا فعال‌سازی کنید.

توجه داشته باشید که BIOS یا UEFI کامپیوتر شما می‌تواند تنظیمات مستقل زیادی را مدیریت کند. به عنوان مثال، این احتمال وجود دارد که تاچ پد لپ تاپ در بایوس غیرفعال شده باشد و همین مسئله مانع از عملکرد آن در ویندوز شود. هنگامی که لپ تاپ را روشن کردید، کلیدهای Del یا F2 را به منظور ورود به تنظیمات بایوس فشار دهید. در ادامه شما می‌توانید وارد بخش تنظیمات شوید و فعال یا غیرفعال بودن بایوس را مورد بررسی قرار دهید.
''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
