import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class tools_needed_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<tools_needed_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/huJFlml1zuM';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title:
                  const Text('ابزار های مورد نیاز تعمیرکار و آشنایی با آنها'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''پیچ گوشتی
پیچ ها تقریبا در تمامی صنایع کاربرد دارند. در صنعت سخت افزار، لپ تاپ، تبلت و گوشی هوشمند نیز بسیار کاربردی بوده و تقریبا در همه جا اثری از پیچ دیده می شود. در تعمیرات لپتاپ نیز اکثر قطعات با پیچ های مختلفی به هم متصل شده اند. قابهای لپ تاپ، برد اصلی، شاسی و سایر اجزا اغلب با پیچ های کوچک به همدیگر متصل می شوند. هر تعمیرکاری نیاز به یک پک کامل پیچ گوشتی داشته که بتواند در باز و بسته کردن اکثر پیچ ها از آن استفاده کند. پیچ های استفاده شده در لپ تاپ ها اکثر از نوع بسیار کوچک بوده بیشتر در دو نوع پیچ های چهارسو و نیز پیچ های ستاره ای دیده می شوند. از این رو داشتن یک پیچ گوشتی چهارسوی کوچک و پیچ گوشتی های ستاره ای با استاندارد T5.T4 و T6 لازمه هر تعمیرکاری است.

پنس یا انبرک
اکثر قطعات و اجزای بکار رفته در بردهای لپ تاپ بسیار ریز بوده و نگهداشتن، برداشتن و جاگذاری آن ها با دست مشکل می باشد. از این رو برای گرفتن و برداشتن این اجزا ریز از انبرک یا پنس استفاده می کنیم. پنس ها از جنس فلز بوده و در انواع مختلفی تولید می شوند. اما در زمینه تعمیرات لپ تاپ دو نوع پنس سر کج و پنس سر صاف بیشترین استفاده را دارند. پنس سر صاف اکثر در برداشتن و گرفتن قطعاتی که بر روی برد قرار دارند استفاده می شود در حالی که پنس سر کج برای برداشتن و قطعاتی استفاده می شود که در جاهایی از برد هستند که اختلاف سطح داشته و یا داخل فرورفتگی قرار دارند.

دستبند آنتی استاتیک
به صورت مچ بندهایی از جنس الیاف رسانا تولید می شوند. این مچ بند ها با پوست دست در ارتباط بوده و تمامی بارهای الکتریکی ساکن در بدن را به وسیبله یک سیم رابط که یک سر آن به دستبند آنتی استاتیک متصل بوده و سر دیگر آن به وسیله گیره کوچک سوسماری به لوله بخاری، رادیاتور شوفاژ، قاب در و یا نهایتا به میخی که در دیوار کوبیده شده متصل می شود. در صورتی که گیره انتهای سیم دستبند به جای مناسبی متصل نباشد دستبند کارایی خود را از دست داده نمی تواند مانع تخلیه بار الکتریکی بدن تعمیرکار به برد شود.

گیره
در تمامی کارهای تعمیراتی نیاز به ثابت ماندن قطعه در حال تعمیر است. از این رو گیره ها در انواع مختلف و برای کاربردهای مختلف تولید می شوند. در تعمیر لپ تاپ و تبلت نیز چند نوع گیره مختلف طراحی شده اند. گیره هایی که برای ثابت نگه داشتن بردهای الکترونیکی و نیز قطعات و اجزا لپ تاپ طراحی شده و اندازه های متفاوتی نیز دارند. در هر تعمیرگاهی می توان چند نوع از این گیره ها را دید که بر روی میز کار نصب شده اند. بعضی از انواع گیره ها مجهز به ذره بین و نیز چراغ هستند که کارهای حساس و دارای ریزه کاری با آن ها ساده تر می شود.

انبردست و دم باریک
انبردست وسیله ای چند منظوره بوده و در اندازه های متفاوت در بازار موجود می باشد. انبردست هایی که در تعمیرات لپ تاپ از آن استفاده می شود کوچک بوده و برای گرفتن پیچ ها و قطعات کوچک فلزی و نیز باز کردن پیچ هایی که یا سری آن ها هرز شده و با پیچ گوشتی قابل باز شدن نمی باشند کاربرد دارد. دم باریک از نظر کارایی شبیه انبردست بوده و فقط نوک انبرک های آن بلندتر می باشد. از این رو از آن می توان در برداشتن اجزای ریزتر و نیز در مواقع لحیم کاری در گرفتن و برداشتن اجسام داغ استفاده کرد. انبردست و دم باریک ها دارای دسته های پوشیده شده با پلاستیک هستند که کاملا عایق بوده و از انتقال الکتریسیته از قطعات به بدن تعمیرکار و نیز برعکس از دست تعمیرکار به برد جلوگیری کند. در هنگام کار با ولتاژ های بالا که به بدن آسیب می رسانند از انبردست و دم باریک هایی استفاده کنید که از عایق بودن کامل دسته آنها مطمئن باشید.

سیم چین و کف چین
از نظر ظاهری به دم باریک و انبردست شباهت داشته ولی در طراحی سر آن ها متفاوت هستند. اهرم های سر سیم چین و کف چین مانند گیوتین طراحی شده و تیز می باشند. هنگامی که به هم می رسند می توانند سیم و یا هر چه که بین اهرم ها باشد را قطع کنند. کف چین همانند سیم چین بوده ولی اهرم های سر آن دارای انحراف و زاویه می باشد. از این رو می توان به راحتی اجزایی مانند پایه های مقاومت و خازن و … را از منتهی الیه آن ها از روی برد قطع کنند.

لوپ و ذره بین
به علت ریز بودن اجزا بکار رفته بر روی لپتاپ ها و برای دقت بالاتر در کار ذره بین استفاده می شود. ذره بین های تعمیراتی انواع مختلفی داشته و قدرت نزدیک نمایی آن ها نیز متفاوت می باشد.

نوع بهتر ذره بین های تعمیراتی مجهز به چراغ می باشند که بسیار کاربردی است و هنگام نگاه کردن اجزا ریز نور کافی بهتر دیدن را به تعمیرکار می دهند. یکی از نقاط ضعف ذره بین ها این است که یک دست تعمیرکار برای گرفتن ذره بین به کار می رود و هنگام تعمیرکار باید یک دستی کار کند. در موارد زیادی تعمیرکار به هر دو دست خود احتیاج داشته و از این رو در این مواقع از لوپ استفاده می شود. لوپ ها در واقع ذره بین هایی هستند که مجهز به پایه بوده و می توان ذره بین و چراغ همراه آن را دقیقا در جایی که لازم است تنظیم کرده و ثابت کرد. بعضی از لوپ ها به شکل میکروسکوپ دو چشمی طراحی شده علاوه بر قدرت بزرگنمایی بالاتر، امکاناتی مانند گیره و چراغ نیز دارند که در هنگام کار بسیار کاربردی می باشند.

اسپاتول
اسپاتول قطعه ای کاردک مانند بوده که کاربرد متعددی دارد. همانطور که در شکل می بینیم سر کاربردک مانند اسپاتول ها می تواند برای پخش خمیر فلکس و نیز برداشتن و جمع کردن اضافات روی برد کارایی داشته باشد. همچنین در شابلون کاری نیز اسپاتول ها در اندازه های مختلف کارایی زیادی داشته و در پخش کردن خمیر مخصوص و نیز صاف کردن سطح شابلون کاربرد دارند که در ادامه می خوانیم.

مولتی متر
مولتی متر ها از اساسی ترین و مهم ترین ابزارهای تعمیراتی لوازم الکترونیکی هستند. همواره برای عیب یابی قطعات می بایست ولتاژ، جریان مصرفی و یا مقاومت آن ها را اندازه گیری کرده و از روی اعداد بدست آمده و تحلیل آن ها سلامت و یا ایراد قطعات و بردها را تشخیص داد. برای اندازه گیری مولفه های الکتریکی قطعات از مولتی متر استفاده می شود. مولتی متر ها در دو نوع آنالوگ و دیجیتال در بازار موجود هستند. نوع دیجیتال دارای دقت بالاتری می باشد ولی امکان اشتباه در آن ها از نوع آنالوگ بیشتر است. مولتی متر ها دارای یک اهرم و دستگیره بوده که با چرخاندن آن می توان نوع کمیت اندازه گیری و نیز دقت دستگاه را تنظیم کرد. به این اهرم و یا دستگیره سلکتور گفته می شود. مولتی متر های پیشرفته تر دارای بخشی برای تست ترانزیستور و نیز امکان تشخیص اتصال کوتاه نیز می باشند. هر چه دقت اندازه گیری مولتی متر بیشتر باشد قیمت آن نیز بالاتر می رود. مولتی متر به اسم های دیگری نیز در بازار معروف می باشد از جمله اهم متر، ولت متر و آمپر متر.

هویه
هویه مهمترین ابزار تعمیرات لپتاپ است. از هویه برای لحیم کاری قطعات و بردها استفاده می شود. در هویه با استفاده از جریان برق دمای سر هویه بسیار بالا رفته و باعث آب شدن سیم لحیم می گردد.

هویه ها در توان های متفاوت تولید می شوند. هویه هایی که از توان بالاتری برخوردار هستند می توانند دمای بالاتری تولید کرده و در صنایع برق صنعتی کاربرد دارند. در تعمیرات لپ تاپ از هویه های با توان پایین و مخصوص لحیم کاری های ریز استفاده می شود. مناسب ترین هویه برای لحیم کاری اجزای لپ تاپ هویه هایی با توان 25 و 40 وات هستند. هویه هایی با توان قابل تنظیم نیز ساخته شده اند که توان تولیدی آن ها قابل تنظیم بوده و می توان با تعویض نوک هویه و نیز تنظیم توان تولیدی برای کاربردهای متفاوت از آن ها بهره برد.

تمیزکننده نوک هویه
در هنگام لحیم کاری روغن لحیم و باقیمانده سیم لحیم به نوک هویه چسبیده و کارایی هویه را پایین می آورد. این ناخالصی ها باعث اکسید شدن نوک هویه شدن و به مرور زمان رنگ نوک هویه سیاه شده و توانایی جذب لحیم در آن کم می شود. از این رو مدام باید نوک هویه تمیز باشد. برای تمیز کردن نوک هویه هرگز از سمباده و یا تیغ تیز و یا اجسام مشابه استفاده نکنید. استفاده از سمباده و تیغ در درازمدت به نوک هویه صدمه زده و فرم آن را تغییر می دهد. از این رو برای تمیز کردن نوک هویه از سیم های نازک فولادی که به صورت اسفنج های گلوله ای در آمده است استفاده می کنند. این گلوله های سیمی معمولا از جنس فلز برنج بوده و همزمان روغن و چربی نوک هویه را جذب کرده و نیز باقیمانده سیم لحیم را از نوک هویه تمیز می کنند. از طرفی به نسبت سمباده نرمتر بوده و آسیبی به نوک هویه وارد نمی کنند. می توان از اسفنج های نسوز که آغشته به تینر می باشند استفاده کرد.

سیم لحیم
برای اتصال قطعات به برد نیاز به سیم لحیم است. سیم لحیم از آلیاژ ترکیبی از سرب و قلع ساخته می شد. این آلیاژ ترکیبی از 50 تا 63 درصد قلع و مابقی سرب ساخته می شود. هر چه میزان سرب موجود در سیم لحیم بیشتر باشد لحیم کاری در دمای بالاتر انجام گرفته و نیاز به هویه های با توان بالاتر می باشد. در نتیجه لحیم انجام شده نیز محکم تر بوده و دوام بیشتری دارد. برای قطعات کوچک و ریز بر روی برد از سیم لحیم های با درصد قلع بیشتر استفاده می شود که دمای ذوب کمتری داشته و سریعتر ذوب می شود. اما برای لحیم کاری قطعات بزرگتر خصوصا در برق صنعتی از سیم لحیم های با درصد سرب بیشتر استفاده می شود. سرب برای سلامتی انسان و محیط زیست مضر بوده و از این رو در سال 2006 استفاده از سرب در آلیاژ سیم لحیم ممنوع شده و سیم لحیم های به اصطلاح بدون سرب در صنایع الکترونیک استفاده می شوند. سیم لحیم های بدون سرب از آلیاژی از ترکیب قلع، مس و نقره ساخته می شوند. از این رو هنگام خرید باید به این نکته دقت کرد. علائمی بر روی بسته های سیم لحیم و.جود دارد که نشان از وجود سرب و یا عدم وجود سرب در آلیاژ سیم لحیم است. از نظر قیمت نیز سیم های بدون سرب به علت استفاده از مس و مقدار کمی نقره قیمت بالاتری دارند.

استند
استند در واقع پایه ای برای قرار دادن هویه است. هویه داغ را نمی توان همینطور روی میز کار رها کرد. زیرا ممکن است باعث آتش سوزی و یا صدمه به دیگر قطعات شود. از این رو در هنگام کار هویه را داخل استند قرار می دهیم. بسیاری از مدل های استند دارای جایی برای قرار دادن اسفنج فلزی برای تمیزکردن نوک هویه هستند. بعضی دیگر نیز جایی برای قرار دادن خمیر لحیم کاری هستند. استندها معمولا به شکل یک فنر مخروطی شکل طراحی می شوند که جنس فلزی داشته و در هنگام کار باید مراقب بود که نوک هویه داغ در صورت برخورد به فنر استند ممکن است صدمه ببیند.

وکیوم یا قلع کش
هنگام برداشتن قطعات روی برد و تمیز کردن لحیم کاری های قبلی، در هنگامی که با نوک هویه لحیم ها را به حالت مذاب در میاوریم با استفاده از وکیوم قلع های مذاب را از برد جدا می کنیم. وکیوم یک لوله فلزی بوده که همانند سرنگ دارای یک استوانه داخلی بوده که به وسیله یک فنر به بدنه لوله فلزی متصل است. با فشار دادن استوانه به سمت پایین فنر فشرده شده و یک دکمه که به وسیله یک فنر به بدنه لوله فلزی متصل است. با فشار دادن استوانه به سمت پایین فنر فشرده شده و یک دکمه به عنوان ضامن عمل می کند در پایین ترین وضعیت فعال می شود. با فشردن دکمه فامن استوانه با قدرت فنر به سمت بالا رفته و حالت مکش را در داخل استوانه ایجاد می کند. با استفاده از این خاصیت مکش قوی لحیم های ذوب شده به داخل لوله وکیوم کشیده می شوند.

فیتیله مسی
فیتیله مسی همانند و هم اندازه یک نخ کاموایی مشبک از جنس سیم نازک مسی بوده که به دور قرقره ای پیچیده می شوند. این سیم مشبک و بافت باز آن اگر در معرض لحیم مذاب قرار بگیرد آن را به خود جذب می کند. از فیتیله مسی در تمیز کاری قلع های به جای مانده بر روی برد استفاده می شود و نتیجه معمولا از جمع آوری لحیم ها با وکیوم تمیزتر است. برخلاف وکیوم، فیتیله مسی یک وسیله مصرفی بوده و هر بار که مقداری لحیم را از روی برد به خود جذب می کند باید کوتاه شده و دور ریخته شود.

هیتر یا هویه هوای گرم
برای لحیم کاری قطعات SMD و نیز قطعات دستگیر که هویه قادر به لحیم آن ها نیست از هیتر استفاده می شود. هیتر وسیله ای که با استفاده از یک المنت و یک کمپروسور، هوای بسیار داغ را به وسیله یک شیلنگ انعطاف پذیر به یک نازل منتقل کرده و تعمیرکار از طریق نازل می تواند هوای با دمای بالا را به برد دمیده و باعث آب شدن لحیم ها شود. هیتر ها از دو قسمت بخش مرکزی و دسته هیتر یا همان نازل تشکیل شده اند. این دو قسمت بخش مرکزی و دسته هیتر یا همان نازل تشکیل شده اند. این دو قسمت به وسیله یک شلنگ به هم متصل می شوند. سر نازل یک لوله فلزی بسیار ریز است که هوا با فشار زیاد از طرف بخش مرکزی به آن رسیده و در داخل دسته یک المنت حرارتی وجود داشته که دمای هوا را به شدت بالا برده و به بیرون دمیده می شود. معمولا به همراه هر هیتر چند سر فلزی با سایزهای متفاوت عرضه می شود که دارای قطرهای مختلف بوده و هر کدام مناسب کار با قطعات مختلف می باشد. دما  شدت فشار این هوا توسط هیتر قابل تنظیم بوده و بسته به شرایط مختلف از دماهای متفاوت و نیز شدت باد مختلف استفاده می شود.

خمیر لحیم
در هنگام لحیم کاری به وسیله هیتر به جای استفاده از سیم لحیم از خمیر لحیم استفاده می شود. خمیر لحیم از همان ماده تشکل دهنده سیم لحیم درست شده است ولی به صورت پودر شده است. این پودر فلزی در داخل یک خمیر روغنی قاطی شده و در هنگام حرارت دیدن توسط هیتر روغن موجود در خمیر بخار شده و پود فلزی به حالت مذاب درآمده و قطعه مورد نظر را به برد لحیم می کند. با سرد شدن مذاب قطعه به محکمی در جای خود قرار می گیرد. ترکیبات موجود در خمیر لحیم در هنگام بخار شدن سمی بوده و حتما باید یک تهویه هدای مناسب در محل لحیم کاری نصب شده باشد تا بخارات سمی حاصل از لحیم کاری را سریعا به هوای آزاد انتقال دهد.

تمیزکننده ها
برای تمیز کردن آثار چربی و نیز گرد و خاک بر روی قطعات با استفاده از برس و مسواک از اسپری های تمیز کننده استفاده می شود. اسپری های تمیزکننده در نوع اسپری خشک و اسپری تر در بازار عرضه می شوند. اسپری خشک برای تمیز کردن برد و قطعات الکترونیکی کاربرد دارد  از اسپری تر در تمیزکردن محورهای چرخنده، اهرم ها و سایر قطعات متحرک استفاده می شود. هرگانه اسپری خشک در دسترس نباشد می توان از تینر نیز به جای آن در تمیزکاری قطعات استفاده کرد.

روغن لحیم
در هنگام لحیم کاری به علت بالا رفتن دمای قطعات سطح فلزی پایه ها دچار اکسیداسیون می شود. این اکسیده شدن پایه ها مانع از اتصال کامل قطعات با برد می شود. از این رو در هنگام لحیم کاری از روغن لحیم استفاده می کنیم. روغن لحیم از ماده ای به نام کلودفون تشکیل شده است که در هنگامی که در معرض دمای بالا قرار می گیرد به محلولی اسیدی تبدیل شده و باعث حل شدن اکسیدهای فلزی و نیز هر گونه گرد و خاک آلودگی را در خود می شود این محلول در هنگام کار بخار شده و در پایان کار فقط کمی از آن در سطح برد باقی می ماند که توسط مواد تمیز کننده قابل تمیز کردن است. بخارات روغن لحیم بسیار سمی بوده و از این رو تعمیرکار در هنگام لحیم کاری نباید در مسیر بخارات قرار بگیرد. تهویه مناسب میز کار از الزامات امنیتی کارگاه بوده و برای سلامتی تعمیرکار الزامی است.

روغن و خمیر فلکس
از نظر کاری کاملا مشابه روغن لحیم بوده و قبل از عملیات لحیم کاری برد و قطعات مورد لحیم کاری آغشته به روغن و یا خمیر فلکش شده تا به اصطلاح لحیم پذیر شده و نیز تمامی آلودگی های سح را در خود حل کنند. روغن فلکس به صورت مایع بوده و از این رو می تواند بیشتر در منافذ ریز و نیز در زیر آی سی ها نفوذ کند. روغن و خمیر فلکس از نظر مواد تشکیل دهنده و نیز دمای کاری با روغن لحیم متفاوت بوده و بیشتر در لحیم کاری قطعات SMD کاربرد دارند.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
