import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class bga_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<bga_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/d6iGqyBsHxQ';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text(' BGA دستگاه'),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''کار با دستگاه بی جی ای ماشین (BGA Machine)
از مواردی که نیاز به تعمیرات در آنها وجود دارد، تعمیرات مادربرد (motherboard) بوده، که تعویض چیپ روی مین برد (mainboard) یکی از اعمالی است که بسیاری از تعمیرکارها حین تعمیر نوت بوک و آموزش با آن مواجه میشوند.
استفاده از ابزارهای معمولی برای تعویض و ریبال کردن چیپ مثل هیتر و دستگاه IR در بیشتر موارد منجر به خسارتهای غیرقابل جبران میشود که شامل ذوب شدن قطعات، تاب برداشتن مادربورد، سوختن چیپ و قطعات الکترونیکی اطراف آن است. برای جلوگیری از این خسارت ها از دستگاه های پیشرفته ی تعویض چیپ به نام BGA استفاده میشود.

آموزش کار با دستگاه بی جی ای ماشین (BGA Machine)
BGA مخفف Ball Grid Array است. چیپ های CPU و گرافیک BGA به دلیل داشتن پایه های منظم توپ قلع به این نام خوانده میشوند. به دلیل دقت و ظرافت طراحی چیپ ها حساسیت کار بر روی آن ها زیاد است، به همین دلیل نمیتوان چیپ ها را با روش های سنتی لحیم کاری یا روش سشوار صنعتی و یا IR تعمیر و تعویض کرد.

مقدار حرارت لازم که بتوان چیپ را جابجا کرد و زمان دقیق حرارت دهی برای هر مین بورد بر حسب تعداد و جنس لایه های تشکیل دهنده متفاوت است. کارخانه ی سازنده مادربرد حداکثر مقدار حرارتی که به قطعه وارد شود تا به آن آسیبی نرسد و زمان حرارت دادن را در کنار محصول ضمیمه میکند. بدلیل اهمیت زیاد میزان دقیق حرارت دهی برای تعویض چیپ و وارد نشدن حرارت مضر به قطعات مجاور از ماشین های BGA استفاده میشود.


Resolte: برای رفع این مشکل باید دستگاه BGA حرارت مورد نظر را به طور دقیق و هدایت شده به چیپ مورد نظر وارد کند تا پایه های قلع با ذوب شدن دوباره در جای اصلی خود قرار بگیرند.

عدم اتصال کامل یا جدا شدن تعدادی از پایه ها، در این مورد یک یا چند پایه به طور کامل از جایگاهشان برای اتصال به برد جدا میشوند و به اصطلاح شکسته میشوند.
Reball: همان طور که مشخص است، تعویض و بازسازی مجدد پایه ها مشکل ترین بخش کار است، در واقع ارزش کار با ماشین BGA مشخص میشود. در مرحله ی یادگیری ریبال کردن باید از دستگاه بی جی ای و روش دستی لحیم استفاده شود.دستگاه BGA مانند روش قبل حرارت موردنظر را به چیپ وارد کرده و سپس با دقت از روی مادربرد برداشته میشود.بعد از این مرحله باید قسمت محل اتصال مادربرد و چیپ از بقایای پایه های قبلی پاک شود. در این روش بعد از پاک کردن سطح اتصال را با خمیر amtech اغشته میکنیم که وظیفه ی نگه داشتن توپهای قلع را دارند. شابلون مربوط به نقشه ی اختصاصی چیپ موردنظر را بر روی قطعه قرار میدهیم و توپهای ریز قلع بر روی آن ریخته میشود، توپها غلطیده و در سوراخهای خالی شابلون قرار میگیرند، به این ترتیب چیپ موردنظر پایه های خود را باز میابد.

برای تثبیت توپهای قلع از سشوار استفاده میشود، حالا یه چیپ سالم داریم که دوباره باید توسط دستگاه BGA در روی مادربورد با حرارت مناسب قرار گیرد، قبل از این محل اتصال چیپ روی مادربرد نیز باید توسط خمیر amtech آغشته شود.

خرابی کامل و یا به اصطلاح سوختن چیپ، این خرابی ممکن است مربوط به ضربه، حرارت زیاد، نوسانات برق یا غیره باشد، که تنها راه حل آن برداشتن چیپ سوخته و قرار دادن یک قطعه جدید است.
Rework: دستگاه BGA حرارت وارد میکند چیپ خراب برداشته میشود، محل اتصال تمیز میشود و در نهایت چیپ سالم بر روی مادربرد نصب میشود.
فاصله ی سری دستگاه BGA و چیپ معمولا 3 میلیمتر میباشد. دستگاه در حین عملیات تعویض چیپ نباید لرزش داشته باشد.

انواع مدلهای دستگاه بی جی ای ماشین (BGA machine)
آموزش دستگاه تعویض چیپ (BGA) تمام اتوماتیک ZM-R6200

این دستگاه به صورت اتوماتیک عمل کرده و با بهره مندی از وکیوم مرکزی و دوربین دو کانونه و بازوی کاملا برقی میتواند با سهولت و دقت بالا اقدام به تعویض چیپ نماید. این دستگاه دارای دو هیتر گرمایشی بالا و پایین، کاملا قابل برنامه ریزی حرارتی و یک صفحه پری هیت از جنس سرامیک و صفحه تاچ، تنظیم کننده شدت باد هیتر بالا (air flow adjust) به همراه لیزر بوده و میتواند با کمترین زمان و بالاترین دقت ممکن تمامی چیپ های بردهای الکترونیکی را تعویض نماید.
 

آموزش دستگاه تعویض چیپ (BGA) نیمه اتوماتیک ZM-R6000

این دستگاه دارای دو هیتر گرمایشی بالا و پایین کاملا قابل برنامه ریزی حرارتی و یک صفحه ی پری هیت از جنس شیشه نشکن و قابلیت کنترل توسط کامپیوتر و لپ تاپ، تنظیم کننده ی هیتر بالا (air flow adjust) وکیوم برقی به همراه لیزر بوده و به وسیله قابلیت وکیوم مرکزی و دوربین میتواند با کمترین زمان و بالاترین دقت ممکن تمامی چیپ های بردهای موبایل، تبلت، کامپیوتر، لپ تاپ، Xbox و... را تعویض نماید.


آموزش دستگاه تعویض چیپ ZM-R5860

این دستگاه یکی از پرفروش ترین و محبوبترین دستگاه تعویض چیپ بین تعمیرکارها محسوب میشود و در دو مدل دوربین دار و فاقد دوربین ارائه میشوند. این دستگاه دارای دو هیتر گرمایشی بالا و پایین، کاملا قابل برنامه ریزی حرارتی و یک صفحه سرامیکی و صفحهی نمایش لمسی، تنظیم کننده شدت باد هیتر بالا (air flow adjust)، وکیوم برقی به همراه لیزر بوده و میتواند با کمترین زمان و بالاترین دقت ممکن تمامی چیپ های بردهای صنعتی، تبلت، کامپیوتر، لپ تاپ و ایکس باکس را تعویض نماید.


ماشین آلات تعویض چیپ (BGA machine) دارای چند دسته بندی کلی
ساده(کاملا دستی) فقط دارای تنظیم حرارت از بالا و پایین
ساده و دارای چندین حافظه جهت نگه داری اطلاعات درمورد میزان حرارت از بالا و پایین
مدل قدیمی دستگاهای BGA اغلب مشکل کالیبره حرارتی دارند و بدلیل دقت و حساسیت حرارتهای مورد نیاز راندمان مطلوب ندارند.
دارای منحنی حرارتی و حافظه های مختلف جهت نگه داری انواع نمودار حرارتی برای چیپ ها و مادربوردهای مختلف و پایان کار اتوماتیک اما باز هم ساده
دارای بازو و ابزار خاصی برای قرار دادن چیپ BGA در مکان درست روی مادربرد بصورت اتوماتیک
بعضی دارای دو منطقه ی حرارتی و بعضی دارای سه منطقه ی حرارتی برای اطمینان از بهترین حالت لحیم کاری
بعضی دارای دوربین و مانیتور جهت کنترل دید بهتر در حین عملیات تعویض چیپ، بعضی امکان اتصال را دارند و در صورت تمایل مانیتور و دوربین را نصب میکنیم.



اشتباه رایج به هنگام کار با دستگاه بی جی ای ماشین (BGA machine)

آسیب پد در حین پروسه ی حذف BGA

تعمیر پد BGA آسیب دیده بسیار وقت گیر است ،میتوانیم از پد جایگزین استفاده کنیم.

آموزش ناکافی اپراتور

تکنسین کار با BGA باید بطور کامل آموزش دیده و مهارتهای خود را با تمرین توسعه بدهد.

انتخاب تجهیزات نامناسب

برای rework بی جی ای تجهیزات مورد استفاده باید دارای انعطاف پذیری، قابلیت حفظ و قابل پیش بینی باشند. این شامل سنسور حرارتی حلقه بسته است که گرما را بعنوان فرآیند نیاز کنترل میکند و محصول را برای برداشتن و جایگزینی اداره میکند.


آماده سازی مادربرد و دستگاه Bga Machine

دستگاه بی جی ای ماشین برای برداشتن چیپ های مین بردها و قراردان چیپ نو کارایی دارد. در آموزش تعمیر لپ تاپ، آموزش تعمیر کنسول بازی، آموزش مهندسی معکوس، آموزش تعمیر تبلت، آموزش تعمیر بردهای صنعتی و آموزش تعمیر ایسیو این دستگاه برای برداشتن چیپ ها لازم است. هر چه دستگاه حالت اتوماتیک و پیشرفته تری داشته باشد میتواند عملکرد خوبی در تعویض داشت.

قبل از حرارت دادن به BGA باید نکات زیر را رعایت کرد

رطوبت دستگاه BGA باید گرفته شود.
حذف یا حفاظت از قطعات حساس به حرارت در نزدیکی چیپ برای جلوگیری از آسیب و یا ذوب شدن غیر عمدی قطعات الزامی است.
خمیر لحیم کاری استنسیل ومواد شیمیایی و آلیاژها دقیق انتخاب شوند.
قبل از چرخه دوباره همه چیز را چک کرده شامل یک ارزیابی دقیق از چیزهایی مانند اندازه توپ لحیم، آسیب ماسک لحیم کاری و پد گمشده و یا آلوده در محل PCB است.

آسیب حرارتی های ناخواسته دستگاه بی جی ای ماشین

ذوب شدن قطعات مجاور یا آسیب دیدن آنها نتیجه اکسیداسیون، خیس کردن پد، آب شدن پایه های قطعات مجاور و چیپ های دیگر است.
تکنسین باید به طور مداوم از تأثیر حرارت و هدف دستگاه BGA آگاه باشد و بداند که چگونه به دیگر اجزای مجاور آسیب نرسد، هدف این است که رفتن حرارت فراتر از جزء BGA به حداقل برسد.

بازرسی ناکافی پس از قرار دادن قطعه در بی جی ای ماشین

اجتناب از شش اشتباه رایج در استفاده از BGA بهترین راه برای اطمینان از روند موفق، بازده بالاتر و کاهش هزینه در تعمیرات و تعویض چیپ ها و آموزش و یادگیری سریعتر است.

با دستگاه آی آر بی جی ای ماشین نیز میتوان چیپ هایی که روی مادربردهای پلی استیشن، ایکس باکس که بصورت BGA موجود است را ریبال و تعویض کرد. همچنین در تعمیر روترها، مادربرهای سرور، تعمیرات بردهای صنعتی، تعمیرات روتر، تعمیر تبلت، تعمیرات کارت گرافیک، تعمیر مانیتور، تعمیرات تلویزیون، تعمیرات بردهای پزشکی حرفه ای، تعمیر ایسیو خودرو و خیلی دیگر از مین بردهایی که این چیپ ها را بعنوان پردازنده استفاده میکنند تعمیر کرد. برای اینکه بتوانید تمرکز بهتری برای برداشتن و جازدن آی سی ها و چیپ ها داشته باشید روی بردهای خراب و معیوب با رعایت اینکه به دستگاه BGA Machine خود آسیبی نرسانید تمرین کنید.



''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
