import 'package:flutter/material.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class common_prob_main extends StatefulWidget {
  resistor_page createState() => resistor_page();
}

class resistor_page extends State<common_prob_main> {
  late YoutubePlayerController controller;

  @override
  void initState() {
    super.initState();

    const url = 'https://youtu.be/lu-xyedHI6A';
    controller = YoutubePlayerController(
      initialVideoId: YoutubePlayer.convertUrlToId(url)!,
      flags: const YoutubePlayerFlags(
        mute: false,
        loop: false,
        autoPlay: false,
      ),
    );
  }

  @override
  void deactivate() {
    controller.pause();
    super.deactivate();
  }

  @override
  void dispose() {
    controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) => YoutubePlayerBuilder(
      player: YoutubePlayer(
        controller: controller,
      ),
      builder: (context, player) => Scaffold(
            appBar: AppBar(
              title: const Text('ایرادات رایج در تعمیرات '),
              backgroundColor: Color.fromARGB(255, 69, 9, 129),
            ),
            body: ListView(
              children: [
                player,
                Container(
                  padding:
                      EdgeInsets.symmetric(horizontal: 10.0, vertical: 5.0),
                  width: 350,
                  child: Expanded(
                    child: Text(
                      '''1. داغ شدن
 
از آنجایی که محفظه های هوای کم و کوچکی در لپ تاپ ها وجود دارند و قطعات نیز بسیار به هم چسبیده و در هم میباشند، لپ تاپ ها زیاد داغ میشوند. داغ شدن یکی از شایع ترین مشکلات لپ تاپ ها است و در بسیاری از مواقع به دلیل کثیف بودن محفظه های تهویه هوا رخ میدهد. بالاخره محفظه های هر دستگاهی پس از چند ماه کار کردن پر از گرد و خاک و الودگی میشود و در نتیجه هوا به خوبی در آنها جریان نمیابد.
 
بهتر است با یک سشوار (البته باد سرد) تمامی محفظه های لپ تاپ را تمیز کنید. با این کار گرد و خاک تا حد زیادی از بین میروند و محفظه ها آزاد تر میشوند.
همچنین از دیگر دلایل داغ شدن لپ تاپ ها بایوس (Bios) آنها است. بعضی از لپ تاپ ها به دلیل اینکه نسخه بایوس نصب شده بر روی مادربردشان (MotherBoard) قدیمی است و دارای نقص میباشد، داغ میشوند. 

2. کند شدن هارد دیسک
 
هارد دیسک ها به مرور زمان کند میشوند. آن هم به این دلیل است که هم اطلاعات بیهوده زیادی اعم از فایل های کش (Cache)، فایل های موقت (Temporary) و... در آنها ساخته میشوند و همچنین فایل هایی که در هارد وجود دارند به هم ریخته میشوند. به به هم ریختگی فایل ها در هارد دیسک ها به اصطلاح “Fragmenation” میگویند.

همانطور که میدانید هارد دیسک ها دارای یک دیسک سخت در داخل خود هستند و زمانی که فایل های هارد "فرگمنت" شده باشند، (یعنی هر کدام از آنها در یک بخش از دیسک نوشته شده باشند) در این مواقع باید هارد را "دیفرگ" (Defeag) کنید تا فایل ها به یک بخش از دیسک بروند تا هارد سریع به انها دسترسی پیدا کند. یعنی در کل فایل ها مرتب شوند.
 
به منظور دیفرگ کردن هارد دیسک میتوانید از برنامه “Optimize Drives” ویندوز استفاده کنید. بدین منظور عبارت “Disk Defragment” را در منوی استارت جستجو کنید و سپس اولین نتیجه که ظاهر میشود را باز کنید. در این بخش بر روی درایو “:C” کلیک کنید تا هایلایت شود و سپس گزینه ی “Analyze” را کلیک کنید تا چک شود که آیا فایل های هارد به هم ریخته اند و یا خیر. پس از اتمام چک کردن، علامت درصد در مقابل هارد شما نمایش داده میشود که آن درصد به هم ریختگی است. هم اکنون با کلیک بر روی هارد و سپس انتخاب گزینه ی “Defragment” هارد دیفرگ خواهد شد. البته این کار شاید تا ساعت ها نیز طول بکشد.


3. افت در طول عمر باتری
 
کاربران زیادی پس از چند ماه که با لپ تاپ خود کار میکنند، به یکباره متوجه میشوند که دیگر باتری لپ تاپ آن ها همانند روز اول نیست و تنها چند دقیقه پس از جدا کردن از شارژر لپ تاپ خاموش میشود. این به آن دلیل است که اکثر باتری هایی که در لپ تاپ ها استفاده میشوند از جنس "لیتیوم-یون" هستند و اینگونه باتری ها یک چرخه عمر دارند.
 
متاسفانه در این مواقع باید به فکر خرید یک باتری جدید باشید. حین خرید باتری به این موضوع دقت داشته باشید که باتری دارای ضمانت باشد.


4. کمبود حافظه رم
 
اگر زمانی که تعداد زیادی نرم افزار را به صورت همزمان در سیستم باز میکنید و سپس سیستم هنگ میکند، به این دلیل است که لپ تاپ شما از کمبود رم (RAM) رنج میبرد! در این مواقع دو راه بیشتر ندارید: یا اینکه یک رم دیگر نیز برای لپ تاپ خود خریداری و در آن نصب کنید و راه دوم هم این است که میزان فایل “Page File” سیستم را افزایش دهید. اگر نمیدانید که Pafe File چیست، مقاله زیر را مطالعه کنید:

معرفی Page File ویندوز
 
در حقیقت “Page File” فایلی است که در هارد دیسک سیستم ایجاد میشود و در مواقعی که رم پر میشود، بعضی از نرم افزار ها به این فایل فرستاده میشوند تا از کند شدن و هنگ سیستم جلوگیری شود. به منظور افزایش حجم فایل Page File به کنترل پنل بروید، وارد بخش “System & Security’ شوید و بر روی گزینه ی “System” کلیک کنید.
 
در این بخش بر روی گزینه ی “Advanced System Settings” شوید تا یک پنجره باز شود. در این پنجره بر روی گزینه ی “Settings” در بخش “Performance” شوید و سپس بر روی تب Advanced کلیک کنید. در این تب بر روی “...Change” کلیک کنید و نهایتا میزان حافظه Page File را افزایش دهید.
5. خراب شدن هارد دیسک
 
هارد دیسک ها در مقابل ضربه و تکان شدید بسیار آسیب پذیر هستند. اگر هارد دیسک شما صدای تق تق و یا وز وز میدهد و بسیار کند کار میکند ، ممکن است به آن معنا باشد که زمان آن رسیده که تعویضش کنید. البته قبل از انجام این کار میتوانید هارد را امتحان کنید و ببینید که واقعا خراب است و یا خیر.
 
بدین منظور عبارت CMD را در منوی استارت جستجو کنید و اولین نتیجه که ظاهر میشود را باز کنید. در خط فرمان CMD دستور زیر را وارد کنید:
 
Chkdsk C:
 
با این دستور، ویندوز هارد را چک میکند و در صورت یافت ایرادات، به شما اطلاع میدهد. اگر ایراداتی یافت شدند، با دستور زیر شاید مشکل برطرف شود:
 
Chkdsk C: /f /r


 
6. خرابی کیبورد
 
اگر کلید های کیبورد شما سفت شده اند، گاهی اوقات درست کار نمیکنند و یا حروف بر روی آن محو شده اند، باید کیبورد را تعویض کنید. پس از تعویض کیبورد حتما یک کاور (Cover) برای کیبورد خود خریداری کنید تا نه تنها در مقابل خط و خش، بلکه در برابر نفوذ مایعات نیز از کیبورد محافظت کند و عمر آن را افزایش دهد.

7. عدم اتصال به Wi-Fi
 
قبل از انجام هر کار دیگری، مطمئن باشید که وای فای لپ تاپ شما روشن باشد. بعضی از لپ تاپ کلیدی بر روی کیبورد به منظور روشن کردن وای فای دارند. مطمئن باشید که این کلید در حالت روشن قرار دارد و همچنین وای فای از داخل ویندوز نیز روشن باشد. اگر پس از انجام این کار های وای فای هنوز روشن نمیشود، درایور کارت شبکه لپ تاپ خود را آپدیت کنید. با این کار به احتمال زیاد مشکل حل خواهد شد.

8. خاموش شدن و یا گیر کردن پیکسل های صفحه نمایش
 
این مشکل نه تنها در صفحه نمایش لپ تاپ ها، بلکه در صفحه نمایش هر دستگاهی پیش میاید. به پیکسل هایی که کلا خاموش شده و سیاه شده اند، به اصطلاح "پیکسل مرده" و یا همان “Dead Pixel” میگویند و به پیکسلی که در یک رنگ گیر کرده و دیگر رنگ آن تغییر پیدا نمیکند، "پیکسل گیر کرده" و یا همان “Stuck Pixel” میگویند.
 
تنها دو راه برای از بین بردن پیکسل های مرده و یا آسیب دیده وجود دارند که اولین روش نرم افزاری و دوم روش دستی است. در روش نرم افزاری میتوانید از نرم افزار هایی که به منظور از بین بردن پیکسل های مرده طراحی شده اند استفاده کنید. از بین این نرم افزار ها میتوان به "Dead Pixel Buddy" اشاره کرد. در روش دستی با یک دستمال نرم انگشت خود را بر دور و روی پیکسل بکشید.



9. بوت نشدن سیستم
 
بوت نشدن سیستم میتوانید دلایل زیادی داشته باشد. البته این مورد دو حالت دارد و حالت اول این است که لپ تاپ به هیچ وجه روشن نمیشود و حالت دوم این است که روشن میشود اما سیستم عامل ویندوز بالا نمیاید. اگر حالت اول باشد، یعنی یا شارژ لپ تاپ تمام شده و یا یک اشکال سخت افزاری دارد. آن را یک بار به شارژر متصل کنید و مجددا امتحان کنید.
 
اما اگر حالت دوم باشد، یعنی روشن شود اما ویندوز بوت نشود، به احتمال زیاد مشکل یا از هارد دیسک و یا از سیستم عامل ویندوز است. یعنی فایل های سیستمی ویندوز آسیب دیده اند.




 
10. ویروسی شدن لپ تاپ
 
از علائم ویروسی شدن ویندوز میتوان به کند شدن سیستم، نمایش تبلیغات در محیط ویندوز و هنگ کردن بیهوده اشاره کرد. در این مواقع میتوانید از یک آنتی ویروس قدرتمند به منظور اسکن و یافت ویروس ها در سیستم استفاده کنید.


11. مشکل در پخش ویدیو ها
 
اگر حین مشاهده فیلم در لپ تاپ تان ویدیو به صورت مدام گیر میکند و یا در کل به خوبی نمایش داده نمیشود، مشکل از درایور کارت گرافیک شماست. در این مواقع باید درایور کارت گرافیک خود را به آخرین نسخه بروزرسانی کنید. با این کار مشکل شما حل خواهد شد.

''',
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                      style: TextStyle(fontWeight: FontWeight.w500),
                    ),
                  ),
                ),
              ],
            ),
          ));
}
